[
  {
    "patient_id": "P001",
    "interview_transcript": "I'm Sarah, 34 years old, and I've been dealing with Crohn's for about eight years now. It all started when I was 26, working as a marketing manager in Chicago. The first symptoms were these terrible stomach cramps that would hit me out of nowhere, usually after meals. I thought it was just stress from work, you know how it is in that industry. My primary care doctor, Dr. Martinez, initially diagnosed me with IBS and told me to manage my stress better, eat more fiber. But the symptoms kept getting worse. I was losing weight rapidly, dropped about 20 pounds in two months, and the diarrhea was becoming unmanageable. I remember having to map out bathrooms everywhere I went. Finally, after about six months of this nightmare, Dr. Martinez referred me to a gastroenterologist, Dr. Rebecca Chen. The wait for the appointment was another two months. Dr. Chen ordered a colonoscopy right away, along with blood work and imaging. The colonoscopy showed significant inflammation in my ileum and parts of my colon, classic Crohn's presentation she said. We started with mesalamine, 4 grams daily. I was hopeful, but after three months, there wasn't much improvement. Then we tried azathioprine, which actually made me feel worse. I developed severe nausea and my liver enzymes went up. That's when Dr. Chen brought up biologics. She explained that Humira or Remicade could be game-changers for someone with moderate to severe Crohn's like mine. I was terrified of the injections and the potential side effects - increased infection risk, possible lymphoma. Plus, my insurance initially denied coverage. It took three appeals and four months of back and forth before they approved it. I've been on Humira for five years now, self-injecting every two weeks. The first few months were rough, lots of injection site reactions, but now it's just part of my routine. My Crohn's is mostly in remission, though I still have the occasional flare, especially when I'm stressed. I also developed psoriasis about two years ago, which my rheumatologist says might be related to the Humira, but the benefits outweigh the risks for me. I take vitamin D and B12 supplements because of absorption issues, and I see Dr. Chen every three months for monitoring. The annual cost without insurance would be about $70,000, which is insane. Thank god my employer has good coverage now. Looking back, I wish I had pushed harder for a specialist referral earlier. Those first six months of suffering were unnecessary."
  },
  {
    "patient_id": "P002",
    "interview_transcript": "My name's Michael, I'm 42, male, and my Crohn's story is complicated by my type 2 diabetes, which I've had for ten years. The digestive issues started about three years ago. At first, my endocrinologist thought it was diabetic gastroparesis because I was having trouble controlling my blood sugar and experiencing nausea after meals. We adjusted my metformin dose, tried different timing with meals, but nothing helped. The abdominal pain got progressively worse, and I started having bloody diarrhea, which finally triggered a GI referral. The gastroenterologist, Dr. Patel, was thorough. Colonoscopy, endoscopy, CT enterography, the works. Diagnosed with Crohn's affecting my terminal ileum and ascending colon. Started on prednisone for immediate relief, which wreaked havoc on my blood sugar control. Had to significantly increase my insulin. Then tried mesalamine, no improvement. Moved to methotrexate, but my liver wasn't happy, probably because of my diabetes medications. Dr. Patel wanted to start me on a biologic, specifically Stelara, but my insurance classified it as tier 4, meaning I'd have to pay $800 per month even with coverage. I'm a high school teacher, that's not feasible. We're currently trying to get financial assistance from the drug company. Meanwhile, I'm on budesonide, which helps somewhat but isn't a long-term solution. The diet restrictions are killing me - between managing diabetes and Crohn's, I feel like I can't eat anything. My wife has been amazing through all this, but I can see it's wearing on her too. I've also developed anemia from the chronic bleeding, so I'm on iron supplements, which ironically cause more GI upset. Sometimes I wonder if the cure is worse than the disease. Dr. Patel keeps pushing for the biologic, saying it could change my life, but the financial burden terrifies me. We're already paying off medical debt from my diabetes complications two years ago when I had a minor stroke. I'm seeing him again next month to discuss options. Maybe by then, the financial assistance will come through. I'm also dealing with arthritis now, which Dr. Patel says is related to the Crohn's. It's in my knees and lower back, makes teaching all day really challenging. Taking way too much sick leave, worried about my job security."
  },
  {
    "patient_id": "P003",
    "interview_transcript": "I'm Emma, 28 years old, diagnosed with Crohn's at 16. Female, also have anxiety disorder and PCOS. My journey has been long. Started in high school with what my parents thought was just teenage stomach issues. Saw multiple doctors over two years before getting diagnosed. By then, I had developed a fistula that required surgery. Been through the medication rollercoaster - started with sulfasalazine, then mesalamine, then 6-MP, then methotrexate. Nothing really worked well. Finally started Remicade infusions at 19. Life-changing at first, but after three years, developed antibodies and it stopped working. Switched to Humira, worked for about two years, then lost effectiveness. Currently on Stelara every 8 weeks. The injection anxiety never goes away, even after all these years. Each biologic switch required insurance pre-authorization battles that took months. The fatigue is what gets me most. People don't understand that Crohn's isn't just bathroom issues. It's joint pain, skin problems, extreme exhaustion. I had to drop out of college twice. Finally finished my degree online at 26. Dating has been challenging - when do you tell someone you have a chronic illness? How do you explain canceling dates because of flares? Found a supportive partner last year who comes to my infusions with me. Financially, it's been devastating. Even with insurance, my out-of-pocket costs are about $6,000 annually. I live with my parents because I can't afford rent and medical expenses. Want to have kids someday but terrified about pregnancy with Crohn's and going off medications. My GI doctor says many women do fine, but the risk scares me. Also developed osteopenia from years of steroid use. Taking calcium and doing weight-bearing exercises. The mental health aspect is huge - the anxiety about finding bathrooms, the depression from chronic pain. See a therapist regularly, which is another expense. Tried every diet - SCD, low FODMAP, paleo. Nothing makes a dramatic difference. Stress is my biggest trigger. Lost three jobs due to excessive sick days before finding remote work. That's been a game-changer for managing symptoms."
  },
  {
    "patient_id": "P004",
    "interview_transcript": "Robert here, 55 years old, just diagnosed with Crohn's six months ago, though looking back, I've probably had it for years. Male, also dealing with hypertension and high cholesterol. Always had a sensitive stomach, but attributed it to stress from running my construction business. The breaking point came when I collapsed at a job site from dehydration and severe abdominal pain. Emergency room visit led to CT scan showing significant inflammation. They referred me to a GI specialist, took two months to get in. Dr. Williams did a colonoscopy and confirmed Crohn's disease, pretty extensive involvement of my colon. Started me on prednisone immediately, which helped, but he said it's not a long-term solution. Tried mesalamine next, minimal improvement. Then sulfasalazine, which gave me terrible headaches. Now he wants me on a biologic, recommended Entyvio. The problem is I'm self-employed, my insurance is catastrophic coverage only. The medication would cost me $5,000 per infusion, every 8 weeks. That's impossible. I've been trying to manage with diet changes and budesonide, but I know it's not enough. The fatigue affects my work - I used to work 12-hour days, now I can barely manage 6. Had to hire additional help, cutting into already thin profit margins. My wife thinks I should just bite the bullet and pay for the biologic, but she doesn't understand the business finances. We have two kids in college. Dr. Williams mentioned there might be clinical trials I could qualify for, looking into that. The worst part is I can't do the physical work I used to. Bending, lifting, all trigger pain. Considering selling the business, but then what? This is all I know. Also dealing with depression about the diagnosis. At my age, starting over seems impossible. The joint pain is getting worse too, some days I can barely get out of bed. Taking tramadol occasionally, but worried about dependency. Dr. Williams says the inflammation needs to be controlled to prevent complications, mentioned something about increased colon cancer risk. That keeps me up at night."
  },
  {
    "patient_id": "P005",
    "interview_transcript": "Lisa, 31, female, diagnosed with Crohn's five years ago. Also have endometriosis and migraines. The path to diagnosis was frustrating because doctors kept dismissing my symptoms as period-related or stress. Finally, a female GI doctor took me seriously and ordered proper testing. Colonoscopy showed Crohn's in my ileum and cecum. Started with conventional therapy - mesalamine and brief prednisone. Helped initially, but symptoms returned within months. Tried immunomodulators next, azathioprine specifically. Developed pancreatitis, a rare but serious side effect, spent a week in the hospital. That's when we moved to biologics. Started Remicade, but the infusion center was an hour away, and taking that much time off work every 8 weeks was difficult. Switched to Humira for the convenience of home injections. The injection anxiety is real - I have to psyche myself up for 20 minutes before each dose. Ice the area, deep breathing, sometimes a glass of wine. Been stable on Humira for two years now, though I still have mini-flares during my period. The endometriosis and Crohn's seem to feed off each other. Managing both is exhausting. Insurance covers the Humira through a specialty pharmacy, but the prior authorization process every year is a nightmare. Always worried they'll deny it. Side effects include frequent upper respiratory infections and a weird rash that comes and goes. Dermatologist says it might be Humira-induced psoriasis. The irony. Diet-wise, I can't handle raw vegetables, nuts, or anything high-fiber during flares. Living on white rice and chicken gets old. Tried working with a nutritionist, but she wasn't familiar with IBD dietary needs. The fatigue affects everything - work performance, social life, relationship with my boyfriend. He's supportive but I can tell he gets frustrated when I cancel plans. Want to get married and have kids, but timing medications around pregnancy terrifies me. GI doctor says many women do it successfully, but the risk of flaring during pregnancy or postpartum is high. Career-wise, I've had to turn down promotions that would require travel. Can't risk being far from my medical team. The hidden costs of chronic illness that no one talks about."
  },
  {
    "patient_id": "P006",
    "interview_transcript": "Tom here, 38, dealing with Crohn's for about ten years now. Male, also have depression and sleep apnea. The journey's been rough. Initially misdiagnosed with ulcerative colitis, treatment approach was different. Took two years to get the correct Crohn's diagnosis after a small bowel follow-through showed involvement beyond the colon. By then, I'd already developed strictures requiring surgical resection. Lost about 30cm of small intestine. Post-surgery, started on methotrexate, helped for a while but developed lung problems, possibly drug-related. Switched to Humira, miraculous for three years, then stopped working. Insurance wouldn't cover Stelara without failing another anti-TNF first, so tried Remicade. Developed antibodies within six months. Finally got Stelara approved, been on it for two years. The every 8-week injection is manageable, though expensive even with insurance. Copay assistance program helps, but always worried it'll end. Dealing with short bowel syndrome from the surgery means careful attention to nutrition. B12 injections monthly, vitamin D supplements, iron infusions periodically. The fatigue is crushing some days. CPAP helps with sleep apnea, but Crohn's symptoms often wake me anyway. Work in IT, thankfully can work from home when needed. Boss is understanding, but coworkers don't get why I'm out sick so much. They think Crohn's is just stomach aches. The depression predated Crohn's but definitely worsened with diagnosis. Therapy helps, on antidepressants too. Another medication to manage. Relationship ended two years ago, partly due to my health issues. Dating seems impossible - who wants to deal with all this? Parents help financially when needed, embarrassing at my age. Medical debt about $15,000 currently, paying off slowly. Considering bankruptcy but worried about credit implications. Dr. Anderson, my GI, is pushing for combo therapy - adding methotrexate back at lower dose with Stelara. Hesitant due to previous lung issues. Quality of life versus longevity becomes a real question. Some days wonder if all these medications are worth it. Then have a good stretch and remember why I fight. Looking into disability benefits but the process is overwhelming. Just want to feel normal again, whatever that means."
  },
  {
    "patient_id": "P007",
    "interview_transcript": "I'm Jennifer, 45, diagnosed with Crohn's three years ago after decades of misdiagnosis. Female, also hypothyroid and have fibromyalgia. Doctors always attributed my symptoms to fibro or thyroid issues. Finally, severe weight loss and persistent diarrhea led to proper GI workup. Colonoscopy and MRI enterography showed extensive small bowel disease. Started aggressively with prednisone and azathioprine combination. Prednisone gave me moon face, insomnia, mood swings - my teenage kids didn't recognize me. Tapered off after three months. Azathioprine alone wasn't holding things. GI doctor recommended biologics immediately given my age and disease extent. Started Entyvio as insurance covered it better than others. Infusion every 8 weeks isn't terrible, made friends at the infusion center. We call ourselves the IV league. Dark humor helps. Been stable-ish for 18 months. Still have breakthrough symptoms, especially during stress. Going through a divorce, partly related to illness strain on marriage. Ex-husband couldn't handle the medical bills and my limitations. Now managing everything alone - work, kids, illness. Financially drowning. Lawyer fees, medical bills, mortgage. Considering selling house but kids need stability. Work full-time as a teacher, exhausting with Crohn's. Summer breaks are for recovering, not vacationing. Diet is strictly low-residue. Miss salads desperately. Fifteen different supplements daily. Pill organizer looks like a pharmacy. Vitamin D deficiency severe despite supplements. Osteoporosis developing, early for my age. Another medication added. The medical appointment schedule is part-time job - GI, rheumatologist, endocrinologist, primary care, therapist. Kids resent my illness, though they try to hide it. Missed so many of their activities. Mom guilt is real. Dating at 45 with Crohn's and two kids? Yeah right. Joined online support group, helps to know I'm not alone. Some days are okay, others I can barely function. Worried about long-term - will I need more surgery? Will biologics keep working? Can I work until retirement? Disability doesn't pay enough to live on. No easy answers, just taking it day by day. Next appointment discussing adding immunomodulator to Entyvio. More drugs, more side effects, more monitoring. The merry-go-round continues."
  },
  {
    "patient_id": "P008",
    "interview_transcript": "David, 29, male, diagnosed with Crohn's at 21 during college. Also ADHD and generalized anxiety. The timing couldn't have been worse - senior year, job interviews, trying to start adult life. First symptoms were severe fatigue and abdominal pain. University health center kept saying stress. Finally, blood in stool sent me to ER. Emergency colonoscopy found severe inflammation throughout colon and terminal ileum. Started on prednisone and mesalamine. Prednisone made my ADHD medication less effective, couldn't focus on finals. Nearly didn't graduate. First job out of college, tried to hide my condition. Big mistake. Ended up in hospital with obstruction, required NG tube. Lost that job. Started methotrexate, helped but the weekly injections made me so nauseous. Switched to pills, better tolerated. After a year, wasn't enough. Doctor suggested biologics. Insurance required failing two conventional therapies first. Tried 6-MP next, developed pancreatitis. Finally qualified for biologics. Started Remicade. The infusions were tough with work - had to use all sick time and vacation days. Worked for two years, then lost effectiveness. Switched to Humira. The freedom of home injections was life-changing. Could travel, work normal schedule. Been on Humira four years now. Starting to notice decreased effectiveness. Doctor mentioned Stelara or Entyvio as next options. Dreading another switch. Each time feels like starting over. ADHD meds help with brain fog from Crohn's, but stimulants can worsen GI symptoms. Careful balance. Anxiety skyrockets during flares. Therapy essential but expensive. Dating has been journey. Some people run when they hear chronic illness. Current girlfriend is supportive, but I see the worry in her eyes. We want kids eventually, but I'm terrified of passing this on. Genetic counselor said 10% chance if one parent has IBD. Seems high. Career-wise, chose remote tech job for flexibility. Pays well, good insurance crucial. Still, medical costs about $8,000 yearly out-of-pocket. Living with parents to save money, embarrassing approaching 30. Friends don't understand why I can't drink or eat certain foods. Social isolation is real. Found local Crohn's support group, game-changer. People who actually understand. Exercise helps when I can manage it. Some days, walking to mailbox is achievement. Tried every diet trend - keto, paleo, carnivore. Nothing dramatic, though low-fiber helps during flares. Supplement routine extensive - multivitamin, D3, B12, iron, probiotic, turmeric. Who knows if it helps. Just diagnosed with kidney stones, possibly medication-related. Another specialist, another problem. Sometimes feel like my body is falling apart before 30. Try to stay positive but it's hard. Good days make it worthwhile. Just wish there were more of them."
  },
  {
    "patient_id": "P009",
    "interview_transcript": "Rachel, 36, female. Crohn's diagnosis came late - age 33. Spent years being told IBS, stress, anxiety. Also have asthma and recently diagnosed with rheumatoid arthritis. The autoimmune trifecta my doctor jokes. Not funny when you're living it. Looking back, symptoms started in my twenties. Chalked up to busy career in finance. Sixty-hour weeks, eating at desk, no time for doctors. Finally, hospitalization for severe dehydration and weight loss forced the issue. Colonoscopy showed skip lesions throughout colon, classic Crohn's pattern. Started conservatively with mesalamine. Minimal improvement. Added prednisone for flare control. The mood swings were horrible. Snapped at colleagues, cried in bathroom. Not sustainable in high-pressure job. Moved to azathioprine. Three months in, liver enzymes spiked. Had to stop. Doctor recommended biologics but I resisted. Needle phobia since childhood. The thought of regular injections paralyzed me. Tried dietary modifications instead - SCD diet, supplements, acupuncture. Marginal improvement but not enough. Another hospitalization convinced me. Started Entyvio infusions. Easier than injections psychologically. The infusion center became my forced relaxation time. No laptop, no phone calls, just me and Netflix. Worked well for a year, then started developing joint pain. Rheumatologist confirmed RA. Now juggling two autoimmune conditions. Added methotrexate for RA, which ironically might help Crohn's too. Side effects are rough - hair thinning, mouth sores, constant nausea. But the joint pain is manageable now. Career took hit. Passed over for promotion twice. They don't say it's because of sick days, but I know. Considering career change to something less stressful. Financial planning maybe, work with individual clients, set own hours. Insurance through spouse thankfully. His support keeps me going. No kids yet. Fertility concerns with all these medications. Reproductive endocrinologist says it's possible but high-risk pregnancy. Clock is ticking at 36. Parents don't understand. They think I'm exaggerating, being dramatic. Mom suggests yoga and green juice. If only it were that simple. Lost several friendships. People get tired of canceled plans, dietary restrictions. True friends remained, quality over quantity. Therapy helps process grief of chronic illness. Loss of the life I planned. Adjustment to new normal. Some days are harder than others. Fatigue is the worst part. Not tiredness, but bone-deep exhaustion. Caffeine doesn't help, rest doesn't help. Just have to push through. Looking into Stelara as next option. Entyvio losing effectiveness. The medication carousel continues. Wonder sometimes what my liver and kidneys think of all these drugs. Long-term effects worry me more than current symptoms. But what choice do I have?"
  },
  {
    "patient_id": "P010",
    "interview_transcript": "Mark here, 48, diagnosed with Crohn's five years ago. Male, type 2 diabetic, and now dealing with Crohn's-related arthritis. The fun never stops. Started with what I thought was food poisoning that wouldn't go away. Three months of diarrhea before finally seeing doctor. Primary care ran basic tests, all normal except elevated CRP. Referred to gastroenterologist. Three-month wait for appointment while symptoms worsened. Lost 30 pounds, looked skeletal. Colleagues asked if I had cancer. Colonoscopy revealed severe ileocolonic Crohn's. Started triple therapy - prednisone, azathioprine, and mesalamine. Prednisone sent blood sugars through roof. Endocrinologist had to add insulin to my diabetes regimen. Gained all the weight back plus extra. Tapered prednisone after two months. Azathioprine and mesalamine maintained remission for about a year. Then started having severe joint pain. Thought it was just getting older. Rheumatologist said it's enteropathic arthritis, related to Crohn's. Another disease to manage. GI doctor switched approach. Stopped mesalamine, wasn't really helping. Started methotrexate for both conditions. Helped joints but Crohn's flared. Finally agreed to biologics. Insurance nightmare began. Required documentation of failure of multiple therapies. Appeals process took four months. Meanwhile, suffering. Finally approved for Humira. The co-pay even with insurance - $400 monthly. Thank god for manufacturer assistance program. Been on Humira two years. Life is manageable. Not great, but manageable. Inject every two weeks. Wife does it for me, my hands shake too much. Whether from anxiety or arthritis, not sure. Side effects include frequent infections. Had shingles last year, excruciating. Now need shingles vaccine but it's live vaccine, can't have on Humira. Catch-22. Work in middle management. Understanding boss but worried about next reorganization. Can't afford to lose this job, need the insurance. Medical bills already overwhelming. Mortgage, two kids approaching college. Financial stress probably makes Crohn's worse. Vicious cycle. Diet is constant struggle. Diabetes requires certain foods, Crohn's can't tolerate them. Nutritionist threw up her hands. Basically living on grilled chicken and white rice. Boring but safe. Exercise would help everything but fatigue and joint pain make it nearly impossible. Physical therapy twice weekly. Another appointment, another copay. Sometimes wonder what's the point. Then have good week and remember. Son getting married next year. Want to be there, be present, not running to bathroom. That's the goal. Small victories matter. Made it through daughter's graduation without incident. These moments keep me going. Next step might be Stelara if Humira fails. Doctor already preparing me. Always planning next move with chronic illness. Can't just live in present. Exhausting mentally and physically."
  },
  {
    "patient_id": "P011",
    "interview_transcript": "Jessica, 26, female, diagnosed with Crohn's at 19. Also dealing with PCOS and severe anxiety. College was supposed to be best years of my life. Instead, spent it in and out of hospitals. Started freshman year with stomach pain. Health center said stress, normal for new students. But it got progressively worse. Losing weight, constant diarrhea, missing classes. Finally went home and saw family doctor. He immediately sent me to GI specialist. Colonoscopy at 19 was terrifying. Results showed Crohn's throughout colon. Started on prednisone and mesalamine. Prednisone made me gain 40 pounds in two months. PCOS made weight gain worse. Felt like a stranger in my body. Tapered off prednisone, tried to maintain on mesalamine alone. Lasted six months before major flare. Hospitalized for a week. Started methotrexate. The weekly injections became my Friday night ritual. While friends went to parties, I sat with needle. Worked okay for a while. Graduated somehow, miracle really. First job was disaster. Stress triggered massive flare. Ended up needing surgery for abscess. Three months recovery. Lost job, moved back with parents. Started Remicade after surgery. Game-changer initially. Could eat normally, energy returned. Felt like myself again. But after 18 months, developed antibodies. Switched to Humira. The every-two-week injection is manageable. Built life around it. Found remote job in graphic design. Understanding company, good insurance. Dating is complicated. When do you mention chronic illness? First date? Third? Before intimacy? Lost one relationship because he couldn't handle it. Current boyfriend is supportive but I see the strain. Wants kids someday. I do too but terrified. Pregnancy with Crohn's and PCOS seems impossible. Plus genetics - wouldn't wish this on anyone. Seeing therapist for anxiety and medical trauma. PTSD from hospitalizations is real. Smell of certain disinfectants triggers panic. CBT helps but progress is slow. Medication costs even with insurance about $5,000 yearly. Parents help when needed. Guilt about being financial burden at 26. Friends finishing grad school, buying houses, living life. I'm just surviving. Found online community of young adults with IBD. Lifesaver. People who understand missing out, cancelled plans, bathroom mapping. Not alone. Diet is ongoing experiment. Dairy is enemy. High fiber during flare is disaster. Safe foods: white bread, smooth peanut butter, bananas. Exciting stuff. Nutritionist recommended supplements. Taking vitamin D, B12, folate, iron, calcium, probiotic. Small pharmacy in my cabinet. Exercise when possible helps mental health. Yoga, walking, gentle movement. Some days that's impossible. Fatigue like weighted blanket. Future feels uncertain. Will Humira keep working? More surgery ahead? Can I have normal life? Try not to spiral. One day at a time. Small goals. This week: make it to friend's birthday dinner. Next week: who knows. That's life with Crohn's."
  },
  {
    "patient_id": "P012",
    "interview_transcript": "Paul, 52, male. Just diagnosed with Crohn's last year but probably had it for decades. Also have heart disease, high blood pressure. Always had sensitive stomach. Blamed spicy food, stress, aging. Wife nagged me to see doctor for years. Finally, severe pain sent me to ER. CT showed inflammation throughout intestines. GI doctor said I'm lucky no major complications after so long untreated. Started with mesalamine and short prednisone course. Prednisone helped but cardiologist worried about heart. Tapered quickly. Mesalamine alone wasn't enough. Tried sulfasalazine next. Terrible headaches, had to stop. Doctor wanted to start biologic but I resisted. Already take so many medications for heart. Adding immunosuppressant seemed risky. Tried managing with diet, stress reduction. Some improvement but not enough. Quality of life suffering. Couldn't play with grandkids, too tired. Missed family gatherings, always worried about bathrooms. Wife frustrated. Finally agreed to try Entyvio. Doctor said it's gut-selective, less systemic effects. Insurance coverage was battle. They wanted me to try anti-TNF first. Doctor argued those risky with heart condition. Finally approved after three appeals. Started infusions six months ago. Improvement is slow but noticeable. Energy better, less urgency. Still careful with diet. No raw vegetables, limited dairy, avoid nuts. Boring but necessary. Infusion center is interesting. Met people with various conditions. Perspective helps. Could be worse. Side effect is frequent colds. Granddaughter brings home every bug from daycare. Now I catch everything. Worth it to play with her though. Work part-time in hardware store. On feet all day is tough. Boss understanding, lets me take breaks. Customers don't understand why I move slowly sometimes. Retirement in few years. Worried about insurance changes. Medicare coverage for biologics unclear. Another bridge to cross. Marriage strained but surviving. Wife tired of being caregiver. Can't blame her. Not what we planned for golden years. Try to do special things when feeling good. Dinner out, short trips. Making memories while can. Son doesn't understand. Thinks I'm exaggerating. Daughter more supportive. Comes to some infusions. Nice to have company. Doctor monitoring closely. Heart condition complicates everything. Walking tightrope between treating Crohn's and protecting heart. Blood tests every few months. So far, so good. But always waiting for other shoe to drop. That's reality with multiple health issues."
  },
  {
    "patient_id": "P013",
    "interview_transcript": "Amanda, 33, diagnosed with Crohn's at 25. Female. Also have lupus, diagnosed two years ago. The double whammy of autoimmune diseases. Started with intestinal symptoms, typical Crohn's presentation. After colonoscopy confirmation, began standard treatment ladder. Mesalamine first, limited help. Added azathioprine, developed drug-induced hepatitis. Scary few weeks waiting for liver to recover. Moved to biologics earlier than typical. Started Remicade at 26. Worked beautifully for three years. Life was normal-ish. Career progressing, met husband, planned wedding. Then started developing joint pain, rashes, fatigue beyond Crohn's. Rheumatologist ran tests, confirmed lupus. Possibly triggered by Remicade, possibly coincidence. Who knows. Now treating both conditions. Switched from Remicade to Humira, helps both theoretically. Added hydroxychloroquine for lupus. Methotrexate for good measure. Medicine cabinet looks like pharmacy. The injections are routine now. Husband helps when hands too swollen from lupus. He's been rock through everything. Wants children but I'm terrified. High-risk pregnancy with both conditions. Medications would need adjusting. Risk of flare during pregnancy or after. Adoption maybe? Expensive though. Work in marketing, high stress. Probably doesn't help either condition. But need good insurance. Catch-22 of chronic illness. Stress makes sick, need job for treatment, job causes stress. Diet complicated. Anti-inflammatory diet supposedly helps both. Lots of fish, vegetables I can tolerate cooked. No nightshades - tomatoes, peppers. Italian food was favorite, now can't eat it. Social life affected. Friends don't invite to dinners anymore. Too complicated. Found new friends through support groups. They understand cancellations, restrictions. Quality over quantity. Parents worried constantly. Mom researches every new treatment. Sends articles daily. Means well but exhausting. Dad quieter but see fear in his eyes. Their baby girl is sick. Therapy essential. Processing grief, anger, fear. Why me? Not fair. But life isn't fair. Learning acceptance. Some days easier than others. Bad days really bad. Can't get out of bed. Everything hurts. Good days almost forget I'm sick. Almost. Always lurking in background. Financial impact significant. Even with insurance, costs add up. Copays, deductibles, non-covered services. Wiped out savings. Starting over at 33. Dreams adjusted. No longer planning European vacation. Just hope to stay stable. Small goals now. Make it through work week. Attend friend's wedding. Visit family for holidays. Enough. Looking ahead, worried about medication options. What happens when Humira stops working? Running out of biologics to try. New drugs in pipeline but years away. Bridge that when come to it. For now, grateful for stability. Thankful for understanding husband. Appreciating good days more. Silver lining perhaps. Wouldn't choose this journey but finding meaning in it."
  },
  {
    "patient_id": "P014",
    "interview_transcript": "Brian, 41, male. Crohn's diagnosed three years ago. Also have severe psoriasis and recently diagnosed with depression. The psoriasis came first, had it since twenties. When GI issues started, initially thought unrelated. Took forever to connect autoimmune dots. First GI saw said IBS, gave me antispasmodics. Useless. Second opinion led to proper testing. Colonoscopy showed patchy inflammation throughout. Classic Crohn's. Already on methotrexate for psoriasis, doctor hoped would help Crohn's too. Didn't. Added sulfasalazine, allergic reaction. Hives everywhere. Miserable. Switched to biologic that could treat both conditions. Started Stelara. Insurance battle epic. They wanted different drugs for each condition. Doctor had to prove medical necessity for combination treatment. Four months of appeals while suffering. Finally approved. Stelara helping both conditions somewhat. Not perfect but improvement. Skin clearer, less GI symptoms. Still have bad days. Lots of them. Depression hit hard after diagnosis. Already dealing with visible psoriasis. Now invisible illness too. Felt like body betraying me. Started antidepressants, therapy. Slowly helping. Wife supportive but exhausted. Two young kids don't understand why daddy always tired or in bathroom. Try to be present but hard. Missed son's soccer games, daughter's recitals. Guilt overwhelming. Work as electrician. Physical job getting harder. Crohn's fatigue plus joint pain from psoriatic arthritis. Looking into disability but pays fraction of current income. How support family? Union insurance good for now. Worry about future. If can't work, lose insurance. Then what? Trying to save but medical costs eat everything. Diet frustrating. Read everything helps - keto, vegan, carnivore. Tried all. Minimal difference. Basically eat bland, safe foods. Miss pizza desperately. Beer too. Social life nonexistent. Guys don't understand why can't drink, eat wings. Stopped inviting me. Lonely. Found online support group but not same as in-person friends. Parents aging, need help themselves. Should be taking care of them, not other way around. Role reversal hard. Dad doesn't understand these new diseases. His generation, you worked through pain. Exercise impossible some days. Walking to mailbox exhausting. Other days manage short bike ride. Inconsistency frustrating. Never know what tomorrow brings. Medications worry me. Immunosuppressed during COVID was terrifying. Still careful. What's long-term effect? Cancer risk? Doctor says benefits outweigh risks. Easy to say when not your body. Next appointment discussing adding another medication. Injection or infusion for Crohn's since Stelara not quite enough. More drugs, more side effects, more cost. Never-ending. Sometimes wonder what's point. Then daughter hugs me, says love you daddy. That's point. Keep fighting for them. No choice really."
  },
  {
    "patient_id": "P015",
    "interview_transcript": "My name is Caroline, I'm 37 years old, been dealing with Crohn's disease for almost 15 years now. Also have chronic migraine syndrome and was diagnosed with fibromyalgia five years ago. I'm a single mom to two kids, 12 and 9. The beginning was rough - I was 22, just out of college, starting my first real job as a teacher. The symptoms crept up slowly. First just occasional cramping, then more frequent bathroom trips. I ignored it for months, thought it was just stress from the new job. When I finally saw a doctor, she said IBS and gave me fiber supplements. Made everything worse. After six months of increasing pain and weight loss, I demanded a referral to a specialist. The GI doctor ordered a colonoscopy immediately. I'll never forget him showing me the images - my intestines looked like a cobblestone road. Started on prednisone and mesalamine right away. The prednisone was horrible - gained 30 pounds, couldn't sleep, mood swings that scared me. But it did calm the inflammation. Tried to maintain on just mesalamine but within three months I was flaring again. Added azathioprine. Worked for about a year until I developed severe joint pain. Rheumatologist couldn't determine if it was drug-induced or Crohn's-related arthritis. Either way, had to stop the medication. That's when we moved to biologics. Started Remicade when I was 24. The infusion center became my second home. Every eight weeks, I'd spend half a day there. Had to arrange childcare, take time off work. The school was understanding at first, but patience wore thin. Remicade worked wonderfully for about four years. I got married, had my first child. Felt almost normal. Then during my second pregnancy, it stopped working. Couldn't switch medications while pregnant, suffered through. After delivery, started Humira. The self-injections were convenient but psychologically harder than infusions. Giving yourself a shot never feels normal. Humira worked for three years. During that time, my marriage fell apart. Stress of chronic illness, medical bills, and my limitations contributed. Now single mom juggling everything alone. When Humira failed, tried Cimzia. Insurance denied it three times. While fighting insurance, ended up hospitalized with partial bowel obstruction. Finally got approved for Stelara. Been on it two years. It's okay, not great. Still have frequent symptoms but avoiding surgery. That's the goal now - avoid surgery as long as possible. The fatigue is debilitating. Between Crohn's and fibromyalgia, some days I can barely function. Kids have learned to be independent. Too independent. My 12-year-old makes dinner when I can't. Breaks my heart. Financially, it's a disaster. Child support helps, but medical costs overwhelming. Even with teacher's insurance, I pay about $8,000 annually out-of-pocket. Credit cards maxed. Parents help when they can. Considering bankruptcy but worried about future impact. Can't afford to lose any options. Diet is strictly low-residue. Kids eat different meals. Another added complexity and expense. Vitamins and supplements cost fortune - B12 injections, vitamin D, iron infusions when anemic. Regular labs to monitor everything. It's a full-time job being sick. Dating seems impossible. Who wants to deal with this? Had one relationship post-divorce. He tried but couldn't handle the unpredictability. Don't blame him. Focus now is kids and staying stable. Small goals. Make it to son's band concert. Attend daughter's parent-teacher conference. These normal parent things are victories for me. Support group helps. Other single parents with chronic illness understand the unique challenges. We share resources, babysitting, moral support. Lifeline really. Looking forward, I'm scared. What happens when current medication fails? Running out of options. New drugs in development but years away. Kids will be teenagers soon, need college funds. How? Trying to stay positive for them. They've been through enough. Sometimes cry in shower where they can't hear. Release valve necessary. Doctor mentioned combination therapy next - adding methotrexate to Stelara. More side effects to manage. Hair loss, nausea, liver monitoring. But if it keeps me functional, worth it. Has to be. No other choice. Kids need me."
  },
  {
    "patient_id": "P016",
    "interview_transcript": "I'm Steve, 44 years old, and my Crohn's story started about two years ago. At least that's when I was diagnosed. Looking back, I think the signs were there... you know, the bathroom issues, some pain here and there. But I'm the kind of guy who just pushes through. Construction foreman, can't be taking sick days. Male, also dealing with a bad back from years of physical work and honestly, probably drinking more than I should to deal with the pain. Doc says I need to cut that out completely with the Crohn's. Easier said than done. Anyway, it all came to a head when I ended up in the ER. Thought I was having appendicitis, the pain was so bad. CT scan showed inflammation all through my intestines. They admitted me, did a colonoscopy, confirmed it was Crohn's. The GI doc, young guy, very enthusiastic, started explaining all these medication options. Started with something called mesalamine. Didn't do much. Then prednisone which helped with the gut but made me crazy. I mean, seriously aggressive. Almost got into a fight at work. Had to get off that stuff. Now they want to put me on these injection things. Biologics. The cost is insane. Insurance through the union is usually good but they're fighting coverage. Something about needing to fail more medications first. Meanwhile, I'm struggling to work. Can't be running to the porta-potty every hour on a construction site. The guys notice. Lost some respect, you know? That's hard. Trying to change diet but what am I supposed to eat? Wife makes pasta, I can't eat it. Makes meat, too greasy. Living on toast and ensures. Lost about 40 pounds. Look sick. Feel sick. Doc mentioned there's programs to help with medication costs but the paperwork... I'm not good with that stuff. Wife tries to help but she's working two jobs since I've been missing work. It's a mess. Sometimes wonder if those injections are worth it. Heard they suppress your immune system. In construction, always getting cuts, exposed to stuff. Seems risky. But then I have a really bad day and think anything would be better than this..."
  },
  {
    "patient_id": "P017",
    "interview_transcript": "I'm Diana, 29, female, and honestly still trying to figure out this whole Crohn's thing. Got diagnosed about eight months ago but the doctors seem unsure about treatment. Also dealing with ADHD and anxiety which apparently makes everything more complicated. It started during COVID actually. Thought the stomach issues were stress from working from home, being isolated. Then thought maybe long COVID? Took forever to get proper testing. When they finally did the colonoscopy, there was definite inflammation but the doctor called it mild to moderate. Started me on mesalamine. Seemed to help at first? Hard to tell because my symptoms are all over the place. Some weeks I'm fine, others I'm a disaster. The GI doctor is nice but seems hesitant to be aggressive with treatment. Maybe because I'm young? She mentioned biologics but said we should try other things first. So now I'm on azathioprine. The blood tests to monitor it are annoying. Have to go every few weeks. Already have enough appointments with my psychiatrist and therapist. Adding more medical stuff to juggle is overwhelming. My ADHD makes remembering medications hard. Set like five alarms. The anxiety makes everything worse - stress is definitely a trigger but how do you not stress about having a chronic illness? It's a catch-22. Work has been understanding so far. Tech company, good benefits. But I've used a lot of sick time already this year. Worried about job security. Can't afford to lose insurance now. Dating has been weird. Had a few dates since diagnosis. When do you mention it? One guy ghosted after I mentioned having a chronic illness. Another was weirdly too into it, like he wanted to take care of me. Creepy. Just want normal. Parents are in denial. Keep saying maybe it's not really Crohn's, maybe just IBS or food sensitivity. They mean well but it's not helpful. Makes me doubt myself. Maybe I'm overreacting? But then I have a bad flare and know it's real. Reading online about biologics. Lots of people seem to do well on them. Wonder if I should push for them or trust the doctor's conservative approach. Don't want to be difficult patient but also want to feel better. Quality of life matters, right? The fatigue is the worst part. ADHD meds help but then they sometimes upset my stomach. Another balance to figure out. Everything feels like a puzzle I can't quite solve. Trying to stay positive. Joined an online support group for young adults with IBD. Helpful to see others managing careers, relationships, life. Gives me hope. But also scary seeing people who've had surgeries, multiple medication failures. What if that's my future? Trying not to spiral. Therapist says take it one day at a time. Easy to say, hard to do. Next appointment is in two weeks. Going to ask about biologics again. Maybe be more assertive. Advocate for myself. It's hard though. Wasn't raised to question doctors. But this is my life, my body. Need to speak up."
  },
  {
    "patient_id": "P018",
    "interview_transcript": "Richard here, 58 years old. Just got hit with this Crohn's diagnosis six months ago. Thought I was too old for this - doesn't it usually start in young people? Male, already dealing with type 2 diabetes and had a minor heart attack three years ago. Like I needed another thing. Started with what I thought was just constipation, then diarrhea, figured it was something I ate. But it kept going. Weight started dropping. At my age, that scared me - thought cancer. In a way, almost relieved when they said Crohn's. At least it's not terminal. The colonoscopy was rough. Prep was horrible with my diabetes, couldn't keep blood sugar stable. But they found inflammation throughout large intestine. Started me on prednisone first. Blood sugars went crazy, had to increase insulin. Cardiologist wasn't happy about steroids either. Between all my doctors, feels like they're playing medication chess with my body. Tried mesalamine after tapering prednisone. Didn't do much. Now on something called budesonide. It's okay, not great. GI doctor wants to try biologics but I'm hesitant. Already on so many meds. Blood thinners, diabetes meds, cholesterol, blood pressure. Adding immunosuppressants seems risky. What if I get sick? I help watch my grandkids twice a week. They're walking petri dishes. Wife thinks I'm being stubborn. Maybe I am. But these biologics, the cost alone is staggering. We're on Medicare. Coverage is complicated. Donut hole, prior authorizations. Makes my head spin. We're comfortable but not rich. Retirement was supposed to be for travel, not medical bills. Diet is impossible. Diabetic diet says eat fiber, vegetables. Crohn's flares up with fiber. Can't win. Basically living on grilled chicken and white rice. Boring. Miss real food. Golf is my only outlet but some days can't get through nine holes without bathroom break. Embarrassing. Buddies understand but still. This isn't how I pictured retirement. Son thinks I should try the biologics. He researches everything, sends me articles. Means well but overwhelming. Daughter more practical - whatever keeps you functioning, Dad. Maybe time to stop being stubborn. Next appointment will discuss options. Just want some quality of life. Is that too much to ask at my age?"
  },
  {
    "patient_id": "P019",
    "interview_transcript": "I'm Natalie, 24, just graduated college, and boom - Crohn's diagnosis. Female, also have generalized anxiety disorder. Perfect timing, right? Just starting career, adulting, then this. Symptoms started senior year but I ignored them. Thought stress from thesis, job hunting. Everyone has stomach issues in college, right? Ramen diet, alcohol, no sleep. But after graduation, got worse instead of better. Parents made me see doctor. Family friend who's a GI. Did colonoscopy, found inflammation in small intestine and colon. Moderate to severe, he said. Suggested aggressive treatment given my age. Started Humira right away, skipping the traditional steps. Insurance fight was real. They wanted me to fail other drugs first. Doctor wrote letters, appeals. Finally approved. The injection... I can't. Literally cannot do it myself. Anxiety makes my hands shake. Boyfriend does it for me. Feel pathetic. Twenty-four and need someone to give me shots. First job out of college is at marketing firm. They don't know about diagnosis. Scared to tell them. What if they think I can't handle the work? It's competitive field. Can't show weakness. But hiding it is exhausting. Injection day I'm useless. Fatigue, injection site reaction. Call in sick once every two weeks. Not sustainable. Friends don't get it. They're out living their best lives, brunching, traveling. I'm researching bathrooms, packing Imodium. FOMO is real. Instagram makes it worse. Everyone looks so healthy, happy. Started therapy for anxiety but now processing Crohn's grief too. Therapist says it's normal to mourn. But I'm 24, feel too young to be mourning my health. Parents hovering. Mom calls daily. Dad researches treatments. They mean well but suffocating. Need space to process. Moved back home to save money. Humira co-pay is $200 monthly even with assistance program. Plus other meds, supplements. Entry level salary doesn't go far. Embarrassing living at home. Boyfriend supportive but can see the strain. He's healthy, active. I'm tired, restricted. How long before he gets fed up? Already canceled three trips because of flares. Diet trial and error. Nutritionist gave me low-FODMAP plan. Helps but so restrictive. Miss normal eating. Pizza with friends. Coffee dates. Now it's herbal tea and rice cakes. Exciting. Humira working okay. Not perfect but better than before. Still have breakthrough symptoms. Doctor says might need to add immunomodulator. More meds, more side effects. When does it end? Worried about future. Want career, marriage, kids. But how? Already missing work, exhausted. How maintain demanding career? Pregnancy on immunosuppressants? Passing this to kids? Twenty-four feels too young for these worries. Trying to stay positive. Good days exist. Sometimes forget I'm sick. Those days give hope. Hold onto them. But reality always returns. Bathroom urgency during important meeting. Fatigue during deadline. Injection site pain during romantic moment. Constant reminders. One day at a time, therapist says. But at 24, that's a lot of days ahead."
  },
  {
    "patient_id": "P020",
    "interview_transcript": "Gary, 46, diagnosed with Crohn's about seven years ago. Construction worker, so this disease really impacts my livelihood. Also got high blood pressure and probably drink too much - doc keeps telling me to quit completely but after a hard day, beer helps me relax. Started with bloody stools. Ignored it for months, thought hemorrhoids from heavy lifting. Wife finally made me see doctor when I dropped 20 pounds. Colonoscopy showed severe inflammation, ulcers everywhere. Started on prednisone and mesalamine. Prednisone made me rage. Almost lost my job from snapping at supervisor. Got off that quick. Mesalamine didn't do much alone. Tried sulfasalazine, gave me killer headaches. Then methotrexate, made me so nauseous I couldn't work. Doc pushed for biologics but insurance wanted documentation of failing everything else first. Took eight months of appeals while I suffered. Finally got approved for Remicade. The infusions are tough with my work schedule. Every eight weeks, lose a full day of pay. Union helps but still hurts financially. Worked great for about two years, then effectiveness dropped. Increased frequency to every six weeks, helped for a while. Then stopped working completely. Switched to Humira. The home injections are convenient but I hate needles. Wife has to do it. Embarrassing for a grown man. Been on Humira three years now. Starting to notice it's not working as well. More bathroom trips, more pain. Doc mentioned Stelara next. Another fight with insurance coming. Diet is hard. Construction guys eat garbage - gas station food, fast food. Bringing special meals gets you mocked. Try to hide dietary restrictions. Makes it worse. Wife cooks separate meals for me. More work for her. Guilt adds up. Kids don't understand why dad can't eat pizza with them. Missing work more frequently. Construction doesn't have sick leave - no work, no pay. Bills piling up. Considering disability but pays nothing compared to union wages. How support family on that? Brother thinks I'm being dramatic. 'Just tough it out' he says. Doesn't understand the exhaustion, the pain, the embarrassment of crapping yourself at work. Lost some friends. Can't drink with them, always need bathroom, no energy for activities. Isolating. Physical demands of job getting harder. Lifting, climbing, bending all trigger pain. Foreman starting to notice. Worried about being let go. At 46, what else would I do? This is all I know. Sometimes wonder if the medications are worth side effects. Frequent infections, skin issues, joint pain. But without them, I'd be worse. Rock and hard place. Doctor says I need to reduce stress, eat better, stop drinking, exercise. Easy for him to say. Try doing that while working construction, raising kids, dealing with medical bills. Just trying to survive each day. Next appointment discussing Stelara. Another prior authorization battle. More waiting while suffering. Story of my life with Crohn's. Always waiting for next treatment, next approval, next flare. No end in sight."
  },
  {
    "patient_id": "P021",
    "interview_transcript": "Rachel, 31, diagnosed five years ago. Also have endometriosis and chronic fatigue syndrome. The triple threat of invisible illnesses. Nobody understands how sick I am because I look fine. Started with fatigue everyone blamed on busy career. Lawyer, 80-hour weeks normal. But this was different. Then came the stomach issues. Partners at firm not sympathetic to bathroom breaks during depositions. First GI said IBS. Second said stress. Finally, third did proper testing. Colonoscopy showed Crohn's throughout colon and terminal ileum. Started standard protocol - mesalamine, then added azathioprine. Minimal improvement. Moved quickly to biologics. Remicade first. Infusion days meant missing work. Firm tracking billable hours. Every infusion was mark against me. Worked for a year then allergic reaction during infusion. Scary. Switched to Humira. Self-injection more convenient but effectiveness limited. Maybe 50% better. Added methotrexate. Hair started falling out. As female lawyer, appearance matters. Bought expensive wigs. Another cost. Still not controlled. Started Stelara. Insurance denied. Appeals process while getting sicker. Finally approved. Been on it eighteen months. It's okay. Not great, just okay. Meanwhile endometriosis getting worse. Gynecologist wants surgery. But recovery time means more work missed. Can't afford it career-wise. Chronic fatigue makes everything harder. Some days can't get out of bed. Using FMLA leave but limited. Once that's gone, then what? Relationship ended two years ago. He couldn't handle canceled plans, restricted activities, medical focus. Now dating seems impossible. Who has energy? Plus explaining three chronic illnesses overwhelming. Parents supportive but live across country. Feel alone. Hired cleaning service, meal delivery. More expenses but necessary. Survival mode. Work performance suffering. Passed over for partner track. They cited commitment concerns. Code for too much sick leave. Devastating after years of sacrifice. Considering leaving law. But loans to pay, need insurance. Trapped. Therapy helps process anger, grief, frustration. Why me? Had such plans. Now just trying to maintain. Support group introduced me to concept of 'new normal.' Hate that phrase. Don't want new normal. Want old life back. But acceptance necessary for sanity. Small victories matter - made it through trial without bathroom emergency. Completed brief despite brain fog. These are wins now. Diet strictly controlled. No gluten, dairy, high-fiber, nightshades. Basically eat same five safe foods. Social eating impossible. Another isolation factor. Looking into experimental treatments, clinical trials. Desperate for something to work. Current medications just bandaids. Need real solution. But none exists yet. Doctor discussing combination therapy - Stelara plus methotrexate plus who knows what else. Worried about long-term effects. But what choice is there? Quality of life now versus potential problems later. Impossible choice. Sometimes wonder if should just have surgery. Remove affected intestines. But then what if it comes back elsewhere? No good options. That's the reality. Just degrees of bad. Choose your struggle. For now, choosing medication cocktail over surgery. Ask me next year, answer might change. That's life with chronic illness - constantly adapting, never stable, always uncertain."
  },
  {
    "patient_id": "P022",
    "interview_transcript": "James, 35. Crohn's hit me like a truck two years ago. Never sick before, ran marathons, ate whatever. Then boom, life changed overnight. Male, now also dealing with medication-induced diabetes and osteoporosis from steroids. The irony of getting more diseases from treating one disease. Emergency room visit started everything. Severe pain, bloody diarrhea, fever. Thought food poisoning but lasted weeks. CT showed massive inflammation. Emergency colonoscopy confirmed severe Crohn's. Started IV steroids immediately. Spent week in hospital. Went from marathon runner to barely walking to bathroom. Humble doesn't describe it. High-dose prednisone for two months. Developed steroid-induced diabetes. Now insulin dependent. From no medications to multiple daily injections. Life flipped completely. Tapered prednisone, started azathioprine. Helped minimally. GI pushed for biologics quickly given severity. Started Remicade. Insurance company from hell. Denied coverage three times. Meanwhile, I'm deteriorating. Lawyer helped appeal. Finally approved after four months. Remicade worked initially. Gained weight back, energy improved. Returned to work. Software engineer, thankfully can work remotely when needed. But after year, developed antibodies. Stopped working. Switched to Humira. The every two week injection manageable but not as effective as Remicade was. Maybe 60% improvement. Doctor added methotrexate. Nausea terrible first few months. Hair thinning. But combination helping more than Humira alone. Recent DEXA scan showed osteoporosis. At 35. From steroid use. Now on calcium, vitamin D, bisphosphonates. Another medication, another side effect to manage. Can't run anymore. Impact too hard on bones. Swim instead but not the same. Miss runner's high, the community, races. Part of identity gone. Dating complicated. When mention Crohn's plus diabetes plus osteoporosis, see them calculate if worth it. Usually isn't. One woman said I was too much baggage. Harsh but probably true. Parents guilt themselves. Keep asking what they did wrong. Nothing, just bad luck. But they hover now. Weekly calls, constant worry. Add their stress to mine. Work understanding but patience wearing thin. Used all sick leave, now unpaid time off for appointments, bad days. Financial stress adding up. Medical bills despite good insurance about $10,000 annually. Medication co-pays, procedures, specialists. Wiped out savings. Starting over at 35. Considering selling condo, moving back with parents. Humiliating but practical. Can't maintain mortgage and medical expenses. Pride versus survival. Diet complete overhaul. No raw vegetables, limited fruit, no seeds, nuts, whole grains. Everything that was healthy before now off-limits. Diabetic diet adds another layer complexity. Basically chicken, white rice, cooked carrots. Repeat. Boring but safe. Next step if Humira/methotrexate combo fails is Stelara or Entyvio. Running out of options already. Surgery looming possibility. Scared of that. Know people with bags, life-changing. Not ready psychologically. But might not have choice. GI says my disease aggressive. Trying everything to avoid surgery but might be inevitable. Living scan to scan, scope to scope. Always waiting for next result, next decision point. Can't plan future. Want to travel, maybe marry, have kids. But how? Can't even plan next month reliably. That's hardest part - uncertainty. Never knowing when next flare, next complication, next medication failure. Always waiting for other shoe to drop. Exhausting mentally. Therapy helps but doesn't change reality. This is life now. Trying to accept it. Some days easier than others. Good days remind me life still worth living. Bad days question everything. But keep going. What else is there?"
  },
  {
    "patient_id": "P023",
    "interview_transcript": "Monica, 27, diagnosed last year but symptoms started way before. Female, also have PCOS and depression. Doctors kept blaming everything on weight and PCOS. Took three years to get proper diagnosis. Frustrating doesn't cover it. Symptoms started at 23 during grad school. Stomach pain, irregular bowels. Campus health said stress, IBS. Gave me fiber supplements, made worse. Graduated, started teaching job. Symptoms continued. Primary doctor blamed weight. Said lose pounds, problems would resolve. Lost 30 pounds. Problems got worse. Finally demanded specialist referral. GI ordered colonoscopy. Found inflammation throughout colon, some in small intestine. Crohn's disease. Vindication but also devastation. Chronic illness at 26. Started mesalamine. Minimal help. Added prednisone for flare. Gained all weight back plus more. PCOS makes weight loss nearly impossible. Now doctors blame symptoms on weight again. Vicious cycle. Can't win. Tried azathioprine. Developed pancreatitis. Week in hospital. Traumatic experience. Scared of medications now but need treatment. Catch-22 situation. Doctor recommended biologics. Insurance nightmare began. Needed to fail more drugs first despite pancreatitis. Tried methotrexate. Nausea unbearable. Couldn't teach, missed too many days. Finally approved for Humira. Injection anxiety real. Boyfriend helps but relationship strained. He signed up for girlfriend, not nurse. Feel guilty constantly. Humira helping some. Maybe 40% better. Not enough but scared to switch. What if next thing worse? Doctor says need to be more aggressive but fear holds back. Parents don't understand. Think I'm exaggerating. Mom says her stomach hurts too sometimes. Not the same. Invalidating. Stopped sharing struggles. Isolation grows. Teaching with Crohn's is challenging. Can't leave classroom easily. Had accident once. Mortifying. Students don't know but paranoid they suspect. Always planning bathroom access. Career dreams adjusting. Wanted PhD, professor track. Now just want stability. Health insurance crucial. Stuck in job for benefits. Not passionate anymore, just surviving. Depression worsening. Therapy helps but expensive. Another cost adding up. Antidepressants interact with some Crohn's meds. Always something. Support group helpful. Others understand medication fears, bathroom anxiety, relationship strain. Not alone but still lonely. Different from connected. Diet confusing. PCOS needs low-carb. Crohn's flares with vegetables. Basically eating contradictions. Nothing satisfies both conditions. Nutritionist gave up. Said do best you can. Helpful. Not. Financial stress growing. Teacher salary low. Medical costs high. Living paycheck to paycheck. Credit cards for emergencies. Which is always nowadays. Want kids someday but terrified. PCOS makes conception difficult. Crohn's makes pregnancy risky. Medications dangerous for baby. How do others do it? Looking into clinical trials. Maybe new drug will be miracle. Probably not but hope necessary. Current trajectory unsustainable. Next appointment discussing options. Increase Humira frequency? Add another drug? Switch biologics? No good answer. Just choosing least bad option. Story of chronic illness. Sometimes angry at body. Betrayal feels personal. Other times grateful for good days. They exist. Rare but real. Hold onto those. Tomorrow might be better. Or worse. Never know. That's the hardest part. Uncertainty. But keep going. Students need me. Boyfriend loves me, despite everything. Parents try, even if don't understand. Life different than planned but still life. Has to be enough."
  },
  {
    "patient_id": "P024",
    "interview_transcript": "Derek, 40, just diagnosed three months ago but probably had it for years. Thought it was just food sensitivities, getting older. Male, also pre-diabetic and dealing with sleep apnea. Always been bigger guy, doctors blame everything on weight. Finally, new doctor took symptoms seriously. Ordered colonoscopy. Found inflammation everywhere. Said I'm lucky no complications given how long untreated. Started mesalamine and prednisone. Prednisone helped but blood sugar went crazy. Pre-diabetic to almost diabetic overnight. Endocrinologist not happy. Tapered off quick. Mesalamine alone not enough. Having 15-20 bowel movements daily. Can't work like that. I'm a plumber, need to be at job sites, not toilets. Doctor wants to try biologics but insurance saying need to fail more drugs first. Currently trying sulfasalazine. Headaches terrible but pushing through. Need to work, bills don't stop. Wife working extra shifts as nurse to cover my lost income. Guilt enormous. She's exhausted. Trying to change diet but what's left? Everything seems to trigger symptoms. Living on white bread and ensure. Not sustainable. Losing weight rapidly. Look sick. Customers asking if I'm okay. Bad for business. Considering closing company, getting job with benefits. But starting over at 40? Who would hire sick plumber? Stuck between rock and hard place. Parents think I'm being dramatic. Dad worked through everything. Different generation. Don't understand chronic illness. Stopped visiting. Too stressful. Kids worried. Teenagers don't know how to process dad being sick. Try to hide it but they know. See me running to bathroom, missing their games. Adding to their stress during important years. Doctor appointment next week. Going to push hard for biologics. Can't continue like this. Need quality of life. Whatever the cost, will figure it out. Maybe second mortgage. Whatever it takes. Just want to feel human again. Work full day. Attend kids' events. Be husband wife deserves. Not this shell of person. Hope insurance approves. Hope biologics work. Hope period. Because without hope, what's left?"
  },
  {
    "patient_id": "P025",
    "interview_transcript": "I'm Sophie, 22, just diagnosed six months ago during senior year of college. Female, also have severe anxiety and eating disorder history. The Crohn's diagnosis actually came from investigating weight loss that everyone thought was ED relapse. Wasn't. Was actually sick. Validation but also new nightmare. Started with chronic diarrhea junior year. Thought stress. Senior year got worse. Dropping weight rapidly. Therapist thought eating disorder returning. Family staged intervention. Horrible. Kept insisting I was physically sick. No one believed me. Finally, blood in stool. Went to ER. They took seriously. CT showed inflammation. GI consult. Colonoscopy confirmed Crohn's. Extensive involvement small and large intestine. Parents felt terrible for not believing. But damage done. Trust broken. Started treatment immediately. Prednisone and mesalamine. Prednisone caused mood swings. With anxiety already bad, was unbearable. Tapered quickly. Mesalamine helped little. GI wanted to start methotrexate. Scared of side effects. Negotiated trying diet changes first. Mistake. Got worse. Finally started methotrexate. Nausea terrible. Lost more weight. Everyone thought ED again. Frustrating. Actually trying to eat but can't. Graduated somehow. Miracle. Got job offer but had to defer. Can't start career like this. Living with parents. Regression. Friends moving forward, I'm stuck. FOMO intense. Methotrexate not enough. Started Humira two months ago. Too early to tell if working. Injection days are trauma. Needle phobia from ED treatment history. Full panic attacks. Mom has to hold me. Twenty-two and need mommy for shots. Pathetic. Therapy twice weekly now. Processing Crohn's, anxiety, family dynamics. Expensive but necessary. Parents paying. More guilt. More dependence. Dating non-existent. Who would want this mess? Can barely take care of myself. Let alone be partner. Lonely but practical. Social media hurts. Everyone's highlight reel while I'm in survival mode. Deleted apps. Better for mental health. Diet triggering with ED history. Restriction necessary for Crohn's but reminds of disorder. Walking fine line. Nutritionist specializes in both. Helpful but challenging. Weight stable now. Small victory. Worried about future. Want career, independence, family someday. But managing three conditions seems impossible. How do people do this? Sometimes wonder if life worth living like this. Therapist knows. Safety plan in place. Parents watching closely. Not actively suicidal just exhausted. Want break from being sick. But no breaks with chronic illness. That's the hardest part. It's forever. Twenty-two and already tired. How do I do this for sixty more years? One day at a time, everyone says. But days are long. Nights longer. Bathroom trips, pain, anxiety spirals. Medication side effects. When does it get easier? Does it ever? Or is this just life now? Trying to find meaning. Purpose. Reason to keep fighting. Some days find it. Others don't. But still here. Still trying. Has to count for something. Right?"
  },
  {
    "patient_id": "P026",
    "interview_transcript": "Alan, 50, diagnosed with Crohn's eight years ago. Also have Barrett's esophagus and chronic back pain from old work injury. The trifecta of middle-age misery. Construction worker for twenty years, body already beaten up before Crohn's arrived. Started with what I thought was food poisoning. But didn't get better. Weeks of diarrhea, cramps. Finally saw doctor. Did all the tests. Colonoscopy, endoscopy, found inflammation in colon and pre-cancerous cells in esophagus. Double whammy. Started on mesalamine for Crohn's, PPIs for Barrett's. Minimal improvement. Added prednisone for bad flares. Used it four times now. Each time harder to taper. Doctor worried about bone density. Already have back issues, don't need brittle bones too. Tried azathioprine, elevated liver enzymes. Stopped. Methotrexate next, made me feel drunk all the time. Couldn't work safely. Construction and impairment don't mix. Finally went on Remicade three years ago. Infusions every eight weeks. Miss full day of work. Union insurance covers most but co-pays add up. Worked well for two years then effectiveness dropped. Increased frequency to every six weeks. Helped temporarily. Now failing again. Doctor wants to switch to Humira but I'm running out of options. What happens when they all fail? Surgery? Bag? Can't do construction with ostomy. Would mean career over. Then what? Disability pays nothing. Wife works but her salary alone won't cover mortgage. Kids still in high school. College coming up. How pay for that? Stress making everything worse. Vicious cycle. Diet restricted. No spicy, no raw vegetables, no seeds. Boring. Miss real food. BBQs with friends, beers after work. All gone. Social life disappeared. Guys stopped inviting me. Can't blame them. Who wants sick friend who can't eat or drink? Isolation real. Back pain complicates everything. Can't exercise much. Walking okay, everything else hurts. Weight gaining from lack of activity. Doctors blame weight for some symptoms. But can't exercise. Another catch-22. Barrett's requires surveillance. Endoscopy yearly. Always worried about cancer. One more thing to fear. Like Crohn's isn't enough. Sometimes wonder how much body can take. How many diseases before it quits? Dark thoughts but realistic. Not suicidal, just tired. Worn down. Want to see kids graduate, get married. But at what quality of life? Next appointment next month. Will discuss Humira. Another prior authorization battle probably. More waiting while suffering. Story of American healthcare. Rich get treatment, rest of us fight insurance. Bitter? Yes. But earned it."
  },
  {
    "patient_id": "P027",
    "interview_transcript": "I'm Vanessa, 32. Diagnosed with Crohn's four years ago. Female, also bipolar disorder and recently diagnosed with rheumatoid arthritis. The autoimmune system gone completely haywire. All started during manic episode. Wasn't eating, sleeping, taking care of myself. When crashed into depression, noticed bloody diarrhea. Thought stress. Psychiatrist said maybe medication side effect. But gastro symptoms persisted even after med adjustment. Finally saw GI. Colonoscopy showed severe Crohn's. Already had two fistulas forming. Aggressive from start. Surgery to repair fistulas. Traumatic. Recovery during depressive episode nearly impossible. Started Remicade immediately after surgery. No messing with step-up therapy given severity. Infusions every eight weeks became routine. Worked for about eighteen months. Then joints started swelling. Thought Crohn's arthritis. Nope. Rheumatologist confirmed RA. Now battling two autoimmune diseases plus bipolar. Medication management is nightmare. Some drugs interact. Others contraindicate. Psychiatrist, GI, and rheumatologist barely communicate. I'm the go-between. Exhausting. Switched from Remicade to Humira, supposed to help both conditions. Does neither well. Jack of all trades, master of none situation. Added methotrexate. Hair falling out in clumps. Bought wig. Another expense, another blow to self-esteem. Bipolar meds weight gain plus prednisone for flares equals 60 pound gain. Don't recognize myself in mirror. Depression worse. Body image destroyed. Dating? Forget it. Who would want this hot mess? Three major chronic illnesses by 32. Not exactly catch. Work impossible. Was graphic designer. Can't maintain freelance schedule with unpredictable symptoms. Applied for disability. Denied. Appealing with lawyer. Meanwhile, no income. Moved in with parents. Humiliating. Thirty-two and dependent like child. They're supportive but see fear in their eyes. What happens when they're gone? Sister helps but has own life. Can't be burden forever. Guilt compounds depression. Therapy essential but medicaid therapists overbooked. See someone monthly. Not enough during crisis. But better than nothing. Support groups help. Others with multiple conditions understand. But also depressing seeing people suffer. Double-edged sword. Diet complicated. Crohn's restrictions plus medication interactions. Basically eat five safe foods. Cooking energy rare. Lot of protein shakes. Not living, just existing. Sometimes manic episode hits and feel invincible. Stop taking meds. Crohn's flares badly. Hospitalization. Psychiatric hold if really bad. Cycle repeats. Can't seem to break it. Doctors frustrated. I'm frustrating. Know I'm non-compliant sometimes but brain doesn't work right. How explain that? Next step discussing Stelara. Another biologic to fail probably. Or surgery. Remove diseased intestine. But surgery risky with my mental health. What if become depressed during recovery? Non-compliance post-surgery could be fatal. Rock and hard place. Parents aging. Won't be around forever. Need to figure something out. But what? No good options. Just degrees of bad. Choose your struggle. For now, choosing medication roulette over surgery. Ask me tomorrow, might be different. That's life with multiple chronic illnesses. Never stable. Always chaos. Exhausting. But still here. Still fighting. Some days don't know why. Other days remember. Few good moments worth the many bad ones. Maybe. Hope so. Otherwise, what's the point?"
  },
  {
    "patient_id": "P028",
    "interview_transcript": "Thomas, 43, Crohn's for about six years now. It's been a journey I wouldn't wish on anyone. Male, also dealing with chronic kidney disease from years of using NSAIDs for back pain before diagnosis. Didn't know they were destroying kidneys. Another casualty of undiagnosed illness. Started in my late thirties. Thought getting older, work stress. Own a small accounting firm. Tax season always brutal. But symptoms persisted year-round. Finally saw doctor. Colonoscopy revealed Crohn's throughout colon, some small intestine involvement. Started conservatively with mesalamine. Helped initially. Then kidney function started declining. Nephrologist said stop immediately. Many Crohn's meds hard on kidneys. Limited options now. Tried dietary management. Some improvement but not enough. Business suffering. Can't maintain client meetings when need bathroom every hour. Lost several major accounts. Revenue down 40%. Had to let go two employees. Guilt enormous. Started budesonide. Fewer systemic effects, easier on kidneys. Helps somewhat but not long-term solution. GI wants biologics but nephrologist concerned. Immune suppression with kidney disease risky. Caught between two specialists disagreeing. Meanwhile, I'm suffering. Wife frustrated. She didn't sign up for this. Teenage kids embarrassed by dad's bathroom issues. Family dinners ruined by my dietary restrictions. Can't blame them but hurts. Isolation growing. Finally convinced doctors to try Entyvio. Supposedly gut-selective, less systemic impact. Insurance denied three times. Said not proven safe with kidney disease. Four months of appeals. Finally approved. Started three months ago. Too early to tell if working. Infusions exhausting. Whole day lost. Business can't afford me missing more time. But what choice? Considering selling practice. But then what? Who hires 43-year-old accountant with multiple chronic illnesses? Start over? How? Financial pressure mounting. Medical bills, business losses, kids approaching college. Savings depleted. Retirement funds next. Working myself into grave literally. But stopping means no insurance. Catch-22. Kidney function continues declining. May need dialysis eventually. How manage Crohn's during dialysis? Don't want to think about it. But have to plan. That's the thing with chronic illness - always planning for worse. Never just living. Parents want to help but they're on fixed income. Pride won't let me accept. Stupid probably. But need some dignity left. Friends disappeared. Uncomfortable with illness. Or maybe I withdrew. Hard to tell. Either way, alone except for online support groups. They understand medication conflicts, specialist disagreements, insurance battles. Lifeline really. Looking at clinical trials. Maybe something that won't hurt kidneys. Long shot but hope necessary. Otherwise, what's the point? Sometimes wonder if would've been better not knowing. Ignorance was bliss. Now every symptom analyzed, every medication scrutinized, every decision weighted against multiple diseases. Exhausting. But knowledge is power, right? Doesn't feel powerful. Feels overwhelming. Next appointment discussing increasing Entyvio frequency. If kidneys can handle it. Always if. Never certain. That's hardest part - uncertainty. Can't plan future when don't know if will have one. But keep going. Kids need me. Wife needs me, even if frustrated. Clients depend on me. So push through. One day at a time. One hour sometimes. Whatever it takes."
  },
  {
    "patient_id": "P029",
    "interview_transcript": "Linda, 38, living with Crohn's for twelve years now. Female, also have thyroid disease and chronic migraines. The fun never stops. Diagnosed at 26, young professional, thought I had my whole life ahead. Crohn's changed everything. First symptoms during bar exam prep. Stress, thought everyone had stomach issues during bar. But didn't improve after. Actually got worse. Bloody diarrhea, severe cramping, weight loss. Finally saw GI. Colonoscopy showed extensive disease. Started journey through medication ladder. Mesalamine first, minimal help. Prednisone for flares, gained 50 pounds. Appearance matters in law, especially for women. Partners noticed. Comments made. Self-esteem shattered. Azathioprine next. Worked for about two years. Made partner despite everything. Major accomplishment. Then stopped working. Methotrexate added. Hair loss devastating. Bought expensive wig. Another cost, another secret to maintain. Moved to biologics five years ago. Started Remicade. Infusions during work hours tricky. Had to disclose to managing partner. Career trajectory changed after that. Passed over for major cases. Too risky, they said. What if you're sick during trial? Humira next after Remicade failed. Self-injection easier to hide. But less effective. Maybe 60% improvement. Thyroid disease developed three years ago. Another autoimmune condition. More medication. Synthroid daily. Energy still terrible. Migraines increasing. Neurologist thinks stress-related. You think? Managing chronic illness, demanding career, medication side effects. No stress there. Currently on Stelara. Insurance fought it hard. Six months of appeals while suffering. Finally approved. Working okay. Not great, just okay. But okay is good enough now. Standards lowered. Marriage ended two years ago. He wanted kids. I wanted kids. But pregnancy with Crohn's terrified me. Going off meds, risk of flare, passing it on. He said I was choosing illness over family. Maybe was. But couldn't risk it. Now 38, alone, window closing. Sometimes regret. Other times relieved. Dating seems pointless. Who wants complicated woman with three chronic illnesses? Tried few times. Disclosure always awkward. Usually ghost after. Don't blame them. I'd probably run too if positions reversed. Work is life now. At least there I have some control. Can't control Crohn's but can control briefs, arguments, strategy. Threw self into career. Junior associates think I'm machine. Don't see me injecting medication in bathroom, crying from pain in office, planning route to court based on bathroom access. Finances okay. Lawyer salary helps. But medical costs still significant. About $12,000 annually out of pocket. Could be worse. Is worse for many. Try to remember that. Parents supportive but worried. Mom researches constantly. Sends articles, suggestions. Means well but exhausting. Dad quiet but see concern. Their successful daughter reduced to this. Not what they envisioned. Support group keeps me sane. Other professional women with IBD. We understand unique challenges. Appearance pressures, career impacts, relationship struggles. Sisterhood of suffering. Looking into fecal transplant trials. Desperate? Maybe. But conventional approach failing. Need something new. Hope for breakthrough. Otherwise, just managing decline. That's not life. Next appointment discussing combo therapy. Stelara plus something else. More drugs, more side effects, more monitoring. The merry-go-round continues. Sometimes want to get off. But then what? This is my reality. Accept it or be miserable. Try to accept most days. Some days fail. But keep going. What else is there?"
  },
  {
    "patient_id": "P030",
    "interview_transcript": "Marcus, 29, diagnosed two years ago. Crohn's destroyed everything I worked for. Male, also dealing with severe depression and ADHD. Triple threat of mental and physical illness. Was rising star in tech startup. Eighty-hour weeks normal. Loved it. Then symptoms started. Thought stress, too much coffee, startup life. But got progressively worse. Bathroom trips during investor meetings. Humiliating. Finally saw doctor after collapsing at work. Severe dehydration, anemia. Hospitalization. Colonoscopy showed aggressive Crohn's. Entire colon affected. Started high-dose prednisone. Went from fit to bloated overnight. Colleagues noticed. Whispers started. Lost credibility. Startup world is image-conscious. Sick founder is liability. Tried working through it. Mesalamine, azathioprine, kept pushing. But body couldn't keep up. Missing meetings, deadlines. Board lost confidence. Asked me to step down. My company, my baby, gone. Depression hit hard. Already had it, but this triggered major episode. Suicidal ideation. Parents intervened. Moved back home. Twenty-nine and living in childhood bedroom. Eating mom's cooking. Regression complete. Started Humira six months ago. Helps some. Maybe 40% better. Not enough to return to previous life. But something. Applying for jobs. Explaining two-year gap difficult. Can't say truth. They'll never hire sick person. So lie. Feel guilty but necessary. ADHD makes everything harder. Executive dysfunction plus brain fog from Crohn's equals disaster. Can't focus, can't plan, can't execute. Medication for ADHD upsets stomach. Another impossible balance. Therapy twice weekly. Processing loss of career, identity, independence. Therapist says grief normal. Doesn't feel normal. Feels like drowning. Friends from startup world disappeared. Out of sight, out of mind. Fair-weather friends. Painful realization. New social circle from support groups. But different. Bonded by illness, not interests. Something missing. Dating apps depressing. How explain living with parents, unemployed, chronically ill? Don't. Just don't date. Easier that way. Less rejection. Parents supportive but disappointed. Had such high hopes. Now just want me stable. Bar lowered so far it's underground. Try not to be burden but am. Financial drain, emotional drain. See exhaustion in their eyes. Feel guilty constantly. Diet helps somewhat. Low FODMAP, no dairy, minimal fiber. Boring but manageable. Exercise when energy allows. Walking mainly. Used to run marathons. Now walking around block achievement. How far I've fallen. Looking into clinical trials. Conventional approach not working. Need miracle. Or at least significant improvement. Current trajectory unsustainable. Can't live with parents forever. But can't support self currently. Stuck. Next appointment discussing Stelara or Entyvio. Another medication to try and probably fail. Pessimistic? Yes. But realistic based on history. Still have to try. What's alternative? Sometimes think about ending it. Have plan. But parents already lost so much. Can't do that to them. So continue existing. Not living, just existing. Maybe someday will improve. Maybe new drug will work. Maybe will find purpose again. Maybe. Lot of maybes. No certainties. That's hardest part. Unknown. Can't plan when everything uncertain. But keep going. One foot in front of other. One day at a time. Sometimes one hour. Whatever it takes to survive. That's all I can do right now. Survive. Maybe that's enough. Has to be."
  },
  {
    "patient_id": "P031",
    "interview_transcript": "Patricia, 46, Crohn's for fifteen years. Also fibromyalgia and recent breast cancer survivor. When it rains, it pours. Crohn's diagnosis at 31 was devastating enough. Young mom, two toddlers, trying to manage career and family. Then this. Started with presumed stomach flu that wouldn't resolve. Six months of misdiagnosis before finally getting colonoscopy. Moderate to severe Crohn's throughout. Started standard treatment. Mesalamine, prednisone for flares. Managed okay for few years. Not great but functional. Then fibromyalgia hit. Pain everywhere. Fatigue beyond Crohn's. Doctors initially dismissive. Finally rheumatologist confirmed. More medications. Cymbalta for fibro, continuing Crohn's treatment. Interaction city. Moved to biologics seven years ago. Remicade first. Worked well for three years. Then cancer diagnosis. Stage 2 breast cancer at 44. Had to stop all immunosuppressants for chemo. Crohn's went wild. Hospitalized twice during cancer treatment. Hell doesn't describe it. Chemo, radiation, surgery, all while Crohn's flaring. Almost didn't make it. But did. Cancer-free two years now. But cost was high. Crohn's now more aggressive. Scar tissue from inflammation. Partial obstruction twice. Started Stelara after cancer treatment. Oncologist nervous about immunosuppression but agreed quality of life matters. Working somewhat. Better than nothing. But nowhere near remission. Probably never will be after that year off meds. Marriage survived somehow. Husband is saint. Don't know why he stays. I'm not the woman he married. Physically, emotionally, completely different. But he stays. Kids, now teenagers, resentful. Missed so much of their childhood. In hospital or too sick to participate. They understand intellectually but emotionally... damage done. Work impossible now. Was teacher. Loved it. But between three conditions, can't maintain schedule. On disability. Barely covers basics. Husband's salary keeps us afloat. Another guilt source. Feel like burden. Probably am. Diet strictly controlled. Anti-inflammatory for fibro, low-residue for Crohn's, cancer-prevention focused. Basically eat air. Joking. But not much. Support group for cancer survivors. Different group for Crohn's. Another for fibromyalgia. Life is medical appointments and support groups. Not living, just managing diseases. Depression real but afraid of antidepressants. More drug interactions. More side effects. Can't handle more. Parents deceased. Cancer and heart disease. Genetics are cruel joke. Siblings distant. Can't handle my illnesses. Fair enough. I can barely handle them. Sometimes wonder why fight so hard. Quality of life terrible. Quantity might not be worth it. But kids need mom, even damaged one. Husband needs wife, even sick one. So continue. Next step if Stelara fails completely is surgery. Resection. Maybe temporary ostomy. Terrified. But running out of medication options. Bridge when come to it. Story of my life - crossing bridges of crisis. Never just walking peaceful path. Exhausting. Trying to find meaning in suffering. Maybe help others? Started blog about managing multiple chronic illnesses. Few followers. Might help someone. Has to be purpose, right? Otherwise just random cruelty. Can't accept that. Need meaning to continue. Some days find it. Other days don't. But keep looking. Keep fighting. Not ready to give up. Not yet. Too stubborn. Maybe that's my superpower - stubbornness. Kept me alive through cancer. Keeps me going through this. Will keep going until can't. Then... don't know. Cross that bridge when come to it. For now, one day at a time. One symptom at a time. One small victory at a time. That's all I can manage. Has to be enough."
  },
  {
    "patient_id": "P032",
    "interview_transcript": "Frank, 54. Diagnosed with Crohn's just last year. Late onset they say. Lucky me. Male, already dealing with diabetes, heart disease, and arthritis. Crohn's is cherry on top of shit sundae. Pardon language. Symptoms started about two years ago but ignored them. Thought aging, other health issues. Finally wife forced me to mention to doctor. Colonoscopy found inflammation throughout colon, some in small bowel. Started mesalamine. Nothing. Added prednisone. Blood sugar went insane. Cardiologist had fit. Stopped that quick. Now trying sulfasalazine. Headaches terrible but what choice? GI doctor wants biologics but insurance says no. Need to fail more drugs first. Meanwhile I'm miserable. Fifteen bathroom trips a day. Can't leave house. Worked as mechanic forty years. Had to close shop. Can't work when need bathroom constantly. Income gone. Living on savings. Won't last long. Wife still works but she's 52. How long can she keep going? Medicare doesn't cover everything. Costs adding up. Kids grown, have own problems. Can't burden them. Son going through divorce. Daughter has special needs child. They don't need my problems too. Try to hide severity. Diet impossible. Everything restricted for different disease. Literally nothing safe to eat. Living on ensure and rice. Lost forty pounds. Look like skeleton. Friends think cancer. Almost easier to let them think that. At least cancer people understand. Crohn's? Blank stares. Or worse, advice. Have you tried probiotics? Yoga? Positive thinking? Want to scream. Depression worse. But antidepressants interact with heart meds. Can't win. See therapist but what's he gonna do? Fix my intestines? Make insurance approve medications? Useless. But wife insists. So go through motions. Looking into selling house. Downsize to apartment. Free up money for medical costs. But this house is our life. Raised kids here. Every memory in these walls. Another loss. Support group mostly young people. Don't relate. Their concerns different. Career, dating, having kids. I just want to make it to next year. Different perspective. Feel alone even in group. Doctor says I'm complicated case. Multiple conditions make treatment difficult. Everything affects everything else. Like juggling chainsaws. One wrong move and disaster. Next appointment next month. Will push again for biologics. Maybe if I get sick enough, insurance will approve. Seems like that's what they wait for. Let you deteriorate until no choice. American healthcare at its finest. Sometimes think about stopping all medications. See what happens. Can't be worse than this. But wife would kill me. Ironic. So continue. Take twenty pills daily. Feel horrible. Watch life savings disappear. For what? This isn't living. But apparently not dying either. Stuck in between. Purgatory. That's what chronic illness is - purgatory. Not dead but not alive. Just existing in limbo. Forever. Or until body finally gives out. Whichever comes first. Dark thoughts but honest ones. Doctor says stay positive. Easy for him to say. He goes home healthy. I go home to bathroom. Big difference. But tomorrow keep trying. What else is there? Wife deserves that much. After everything, she deserves me trying. So I do. For her. Not for me. For her."
  },
  {
    "patient_id": "P033",
    "interview_transcript": "Nina, 26. Diagnosed at 19. Seven years of hell. Female. Also have severe eczema and recently diagnosed with bipolar II. The mental-physical illness combo is exhausting. College was when everything started. Freshman year, thought it was dining hall food. Everyone joked about getting sick. But mine never stopped. Lost freshman fifteen instead of gaining. By sophomore year, couldn't hide it anymore. Passing blood, severe pain, living in bathroom. Finally went to health center. They actually took it seriously. Referred immediately. Colonoscopy at 19 was terrifying. Parents had to drive up. Remember mom crying when doctor said Crohn's. I was almost relieved - at least it had a name. Started with mesalamine and prednisone. Prednisone triggered my first hypomanic episode. Didn't know I was bipolar yet. Just thought I was feeling amazing finally. Stayed up for three days straight, wrote entire semester's papers. Then crashed hard. Depression so severe I dropped out. Took year off. Started methotrexate. Helped Crohn's but made me so nauseous. Tried to go back to school. Made it two semesters before another flare. Pattern emerged - stress equals flare equals depression equals dropping out. Finally graduated at 24. Six years for four-year degree. Started Humira at 21. Game changer initially. Could eat, energy returned, finished school. But developed severe eczema. Entire body covered. Dermatologist said might be Humira-induced. But couldn't stop - Crohn's controlled. Chose intestines over skin. Now on Stelara. Helps both conditions somewhat. Neither perfect but both manageable. That's win in my book. Bipolar diagnosis came last year. Explained so much. The cycles, the medication reactions, the inability to stick to treatment. Started mood stabilizers. Another medication to juggle. But necessary. Mental health affects physical health affects mental health. Endless cycle. Dating is joke. Hey, I have three chronic conditions, inject myself with immunosuppressants, and might have mood episode at any time. Want to grab coffee? Yeah, no. Stopped trying. Maybe when more stable. If ever stable. Work is challenge. Entry-level marketing job. They don't know about illnesses. Hide injection supplies in purse. Take mental health days as 'food poisoning.' Exhausting maintaining facade. But need job, need insurance. Catch-22. Parents supportive but burnt out. Seven years of crisis is too much. Don't blame them. I'm burnt out too. But can't take break from own body. So we all just continue, exhausted. Friends from college moved on. Careers advancing, getting married, normal lives. I'm still figuring out how to survive. Different timeline. Trying to accept that. Therapy helps. DBT specifically. Skills for managing emotional dysregulation help with medical trauma too. Expensive but worth it. Maybe only thing keeping me functional. Looking into ketamine therapy for depression. Some studies show helps with inflammation too. Insurance won't cover. Of course. But might try anyway. Desperate for relief. Current medication regimen: Stelara, lamotrigine, vitamin D, B12, iron, probiotic. Plus topical steroids for eczema. Medicine cabinet is pharmacy. Sometimes forget which is for what. Diet challenging. Eczema triggered by certain foods. Crohn's by others. Overlap minimal. Basically eat five things. Boring but safe. Social eating impossible. Another isolation factor. Next steps unclear. If Stelara fails, running out of biologics. Surgery possible. But with bipolar, recovery scares me. What if become depressed? Non-compliant? Could be dangerous. Everything is dangerous with multiple conditions. Simple decisions become complex calculations. Exhausting. But here I am. Still fighting. Still trying. Some days don't know why. Other days remember - only 26. Whole life ahead. Maybe treatments will improve. Maybe I'll find stability. Maybe. Hanging onto maybe. It's all I have right now."
  },
  {
    "patient_id": "P034",
    "interview_transcript": "Robert, 61. Crohn's diagnosed five years ago but probably had it longer. Doctors missed it for years. Old guy with stomach problems? Must be age. Wrong. Also dealing with COPD from years of smoking and now peripheral neuropathy from who knows what. Body falling apart systematically. Started noticing symptoms in mid-fifties. Bathroom urgency, cramping. Doctor said IBS, common in older men. Gave me fiber. Made it worse. Changed doctors. New one said diverticulitis. Antibiotics. No improvement. Finally, third doctor ordered colonoscopy. Found Crohn's throughout colon and terminal ileum. By then, significant damage done. Started treatment at 56. Mesalamine first. Minimal improvement. Added budesonide. Helped temporarily. But long-term steroids not option at my age with my conditions. Bones already weak. Tried azathioprine. Liver didn't like it. Stopped. Methotrexate next. The fatigue was unbearable. Already tired from COPD, this made it worse. Couldn't function. Doctor wanted biologics from start but I resisted. Scared of immune suppression with lung disease. What if get pneumonia? Could be fatal. But quality of life so poor, finally agreed. Started Remicade year ago. Infusions tough. Whole day lost. But improvement noticeable. Not great but better than before. Can leave house now. That's something. Neuropathy started six months ago. Feet numb, tingling. Walking difficult. Neurologist can't determine cause. Might be Crohn's-related, might be medication, might be separate issue. Always something new. Diet restricted for multiple conditions. Low-residue for Crohn's. Low-sodium for blood pressure. Diabetic diet emerging as pre-diabetic now. What's left? Nothing appetizing. Wife does her best but frustrated. Cooking separate meals. Shopping for special ingredients. She's 59, wants to enjoy retirement. Instead, she's caregiver. Guilt enormous. Retirement not what we planned. Supposed to travel, see grandkids, enjoy life. Instead, I'm mapping bathrooms and scheduling infusions. She's patient but see disappointment. Can't blame her. Disappointed too. Grandkids don't understand why grandpa always tired or in bathroom. Try to play but energy limited. Missed many events. They're growing up without me really there. Another regret. Financially okay. Pension and social security cover basics. But medical costs eating savings. Wanted to leave something for kids. Now just hoping not to leave debt. Son thinks I should try different biologic. Researches constantly. Sends articles. Means well but exhausting. Daughter more accepting. Just wants me comfortable. She gets it. Support group helpful. Older folks with Crohn's understand unique challenges. We're not worried about careers or pregnancy. We're worried about surviving, maintaining independence, not being burden. Different perspective. Doctor says I'm responding well considering. Considering what? My age? Other conditions? Low bar. But I'll take what I can get. At 61, not expecting miracles. Next appointment discussing adding immunomodulator to Remicade. More drugs. More monitoring. More side effects. But if helps, worth trying. Running out of time to be picky. Looking at maybe ten good years left if lucky. Want them to be actually good. Not just surviving. Want to see grandkids graduate. Want to celebrate fortieth anniversary with wife. Want to travel even if just short trips. Want to live, not just exist. Is that too much to ask? Apparently yes. But keep hoping. Keep trying. What's alternative? Give up? Not yet. Too stubborn. Maybe that's what's keeping me going - pure stubbornness. Worked my whole life, raised family, built something. Not giving up now. Even if body is. Mind still fighting. That has to count for something. So continue with infusions, pills, restrictions. Follow doctor's orders. Try to stay positive for wife. For family. For myself. Some days easier than others. But every day above ground is good day. Even with Crohn's. Even with everything. Still here. Still fighting. That's something."
  },
  {
    "patient_id": "P035",
    "interview_transcript": "Ashley, 30. Diagnosed with Crohn's at 16. Half my life with this disease. Female, also have primary sclerosing cholangitis and autoimmune hepatitis. Triple threat of doom. My liver and intestines are basically attacking themselves. Started as teenager with what parents thought was school avoidance. Stomach aches before tests. But it was real. Lost weight, chronic diarrhea. Finally pediatric GI took seriously. Colonoscopy showed Crohn's. Started mesalamine and prednisone. Missed most of junior year. Had to do homeschooling. Missed prom, graduation parties, normal teenage stuff. Started Remicade at 17. Worked well for several years. Made it through college somehow. Then at 22, liver enzymes went crazy. Thought it was medication. Stopped everything. Got worse. Liver biopsy showed PSC and autoimmune hepatitis. Rare to have both. Lucky me. Now treating three conditions. Ursodiol for PSC. Prednisone and azathioprine for autoimmune hepatitis. Entyvio for Crohn's since it's supposedly liver-safe. Nothing works perfectly. Everything is compromise. Liver doctor wants higher immunosuppression. GI wants lower. I'm caught in middle. Fatigue is unbearable. Not normal tired. Bone-deep exhaustion. Work part-time as graphic designer. Can barely manage that. Boyfriend of three years left last month. Said he couldn't watch me deteriorate. Fair enough. I can't watch it either but don't have choice. PSC is progressive. Will likely need liver transplant eventually. But have to be sick enough to qualify, healthy enough to survive. Another impossible balance. Plus transplant means lifetime immunosuppression. With Crohn's? Recipe for disaster. Parents hovering. Want to help but can't. No one can. Mom researches constantly. Dad drinks more. See him sneaking shots. My illness killing whole family slowly. Insurance through dad's work for now. But I'm 30. Soon will age out. Then what? Can't work full-time for benefits. Marketplace insurance won't cover everything. Looking at medical bankruptcy in future. Fun to think about. Support groups depressing. PSC groups talking about transplants and death. Crohn's groups seem trivial in comparison. Who cares about diet when liver is dying? Perspective warped. Trying to stay positive. Some days successful. Others not. Therapy helps but therapist admits she's out of depth. Rare to have patient with so many serious conditions so young. She tries though. Diet complicated. Low-fat for liver. Low-residue for Crohn's. High-calorie to maintain weight. Impossible combination. Nutritionist gave up. Said do best you can. Helpful. Looking into clinical trials. Need something innovative. Traditional approach failing. But trials risky with multiple conditions. Could make something worse. Always gambling. Next appointment discussing transplant timeline. Not imminent but need to prepare. Where? Who will care for me? How pay for it? So many questions. No answers. Sometimes wonder if worth fighting. Quality of life terrible. Quantity uncertain. But only 30. Should have decades left. Want to experience more. Marriage, kids (adoption probably), career growth. Normal things. But nothing normal with these diseases. Still, keep fighting. No choice really. Body hasn't given up yet, so neither can I. Even when mind wants to. Even when exhausted. Even when hopeless. Keep going. One day, one hour, one minute at a time. That's all I can do. Has to be enough."
  },
  {
    "patient_id": "P036",
    "interview_transcript": "William, 48, diagnosed with Crohn's three years ago. But my story's complicated. Male, also have severe psoriasis and psoriatic arthritis. When I started having GI issues, doctors thought it was related to my arthritis meds. Spent two years trying different NSAIDs, which probably made everything worse. Finally, colonoscopy revealed extensive Crohn's. The good news? Doc said we could treat both conditions with same biologic. The bad news? I'd already failed two biologics for psoriasis. Started on Stelara, which I hadn't tried before. Helped both conditions somewhat. Maybe 50% improvement overall. But insurance company decided after a year it wasn't working well enough. Denied renewal. Had to appeal three times while rationing remaining doses. Finally approved but that gap... both conditions flared horribly. Now trying to get back to baseline. Own a small construction company. Physical work getting impossible between arthritis and Crohn's fatigue. Had to hire more workers, cutting into already thin margins. Some days can't even make it to job sites. Reputation suffering. Guys don't respect boss who's always sick or in bathroom. Wife's a teacher. Thank god for her insurance. But she's talking about early retirement. Then what? My company barely profitable now. Can't afford private insurance with pre-existing conditions. Trapped. Two kids in college. Loans piling up. Medical bills growing. Sold rental property we'd bought as retirement investment. That money gone in eighteen months. Nothing left to sell except house. Not there yet but... looking at reverse mortgage options. Never thought I'd be that guy. Diet's impossible. Everything that helps one condition hurts another. Nightshades bad for arthritis but tomatoes are one thing that doesn't trigger Crohn's. Can't win. Basically living on grilled chicken and white rice. Depression setting in. But antidepressants interact with other meds. Plus, who wouldn't be depressed? Lost my health, career failing, marriage strained, finances destroyed. Pills won't fix that. Parents both gone. Cancer. Sometimes think they were lucky. Quick, definitive. Not this slow deterioration. Dark thought but honest one. Brother tries to help but he's dealing with his own stuff. Disabled veteran. We're quite a pair. Two broken men trying to prop each other up. Support group helps some. Guys who understand losing physical capacity. We were all strong once. Built things. Fixed things. Now we can barely function. Humbling doesn't cover it. Looking into disability but lawyer says I don't qualify yet. Can still work some. Need to be completely unable. So wait until business fails completely? Great plan. Meanwhile, body keeps deteriorating. Doctor wants to add methotrexate to Stelara. More immunosuppression. More side effects. But what choice? Already at 50%. Need better or will lose everything. Not just money. Identity. Purpose. Worth. Next month is decision time. Try new combo or switch biologics again. Running out of options either way. Five years maybe before exhausted all treatments. Then what? Surgery? Wheelchair from arthritis? Liver failure from meds? Don't want to know..."
  },
  {
    "patient_id": "P037",
    "interview_transcript": "I'm Karen, 34, diagnosed with Crohn's six years ago right after having my second child. Female, also have postpartum anxiety that never went away and was recently diagnosed with lupus. The autoimmune avalanche started after pregnancy. Was healthy before kids. Two pregnancies in three years, then everything fell apart. Started with what I thought was just difficulty recovering from C-section. But six months postpartum, still having severe abdominal pain, diarrhea. OB said hormones. Primary said anxiety. Finally got to GI. Colonoscopy showed Crohn's throughout colon. Started mesalamine while breastfeeding. Limited options. Wasn't enough. Weaned baby early to start stronger meds. Mom guilt extreme. Added azathioprine. Helped for about a year. Then joint pain started. Thought it was from carrying toddlers. But got worse. Rashes appeared. Rheumatologist confirmed lupus. Possibly triggered by pregnancy or Crohn's meds. Who knows. Now juggling two autoimmune diseases, two young kids, and trying to maintain marriage. Impossible equation. Started Humira two years ago. Helps both conditions moderately. Maybe 60% improvement. Not enough to be normal mom. Miss so many activities. Room mom? Can't commit. Field trips? Need bathroom access. Sports practices? Too exhausted. Other moms judge. See it in their eyes. Think I'm lazy or uninvolved. If only they knew. Mornings are medication routine, shot planning, symptom assessment. All before kids wake up. Husband tries but doesn't really understand. Says things like 'you don't look sick' or 'maybe if you exercised more.' Stopped trying to explain. Too exhausting. Work part-time from home. Freelance writing. Only way to manage everything. But income sporadic. Financial stress adding to health stress. Vicious cycle. Insurance through husband's job. Terrified he'll lose it or change jobs. We're trapped by my medical needs. He resents it. I know he does. Even if won't say. Parents help with kids but they're getting older. Won't be able to forever. Then what? How manage flares with young children? Already had to call neighbor once when too sick to get kids from school. Humiliating. Kids know mommy's sick but don't understand. Seven-year-old asked if I'm going to die. How answer that? Five-year-old thinks everyone's mommy gives themselves shots. Normalizing my illness for them. But is that good or bad? Diet family challenge. Can't eat what I cook for them. Separate meals. More work. More guilt. Everything is guilt with chronic illness and motherhood. Support group for moms with chronic illness saved me. They understand the unique challenges. Playing through pain. Hiding symptoms from kids. Marriage strain. Mom guilt. We prop each other up. Looking at changing biologics. Humira losing effectiveness. But scared to rock boat. What if next one worse? What if flare during transition? Can't afford to be sicker with young kids. But can't afford not to try either. Next appointment bringing husband. He needs to hear from doctor how serious this is. Maybe then he'll understand. Or maybe not. But have to try. For kids' sake. For marriage sake. For my sake. Because doing this alone is killing me faster than disease. Some days wonder if kids would be better off without sick mom. Dark thought. Therapist knows. Working through it. But it creeps in during bad days. When can't make dinner or help with homework or play. What kind of mother am I? Sick one. That's what. But still their mother. Still here. Still fighting. For them. Always for them. Even when want to give up. Even when exhausted beyond words. Keep going. Because that's what mothers do. Sick or not. We keep going. No choice. They need me. Even broken version. Better than no mom at all. Right? Hope so. Has to be."
  },
  {
    "patient_id": "P038",
    "interview_transcript": "Daniel, 37, Crohn's for ten years now. Life completely derailed. Male, also have ankylosing spondylitis and chronic kidney disease from years of NSAID use before proper diagnosis. Triple threat of chronic illness. Started in late twenties. Back pain first. Rheumatologist prescribed NSAIDs. Took them for three years. Destroyed my kidneys. Nobody monitored. Then GI symptoms started. Took another two years to connect dots. Finally diagnosed with both conditions. Crohn's throughout small bowel, some colon. AS throughout spine. Started biologics immediately. Remicade for both conditions. Worked initially. Life got back on track. Career advancing, got married, bought house. Then Remicade stopped working. Switched to Humira. Less effective. Maybe 40% improvement. But nephrologist said kidneys couldn't handle anything stronger. Caught between three specialists all disagreeing on treatment. Quality of life terrible. Can't sit or stand long from AS. Need bathroom constantly from Crohn's. Fatigue from kidney disease. Work impossible. Was software architect. High-paying job. Had to go on disability. Fraction of former income. Lost house. Marriage crumbled under financial and health stress. Divorced last year. Now living in small apartment. Ex-wife guilty but relieved. Don't blame her. I'm relieved for her too. She deserves better than sick husband. Dating impossible. Who wants 37-year-old on disability with three chronic diseases? Nobody. Accepted that. Loneliness crushing though. Parents supportive but elderly. Worry about them worrying about me. Role reversal happening too soon. Supposed to be caring for them now. Instead, they're helping me financially. Humiliation complete. Friends disappeared. Uncomfortable with illness. Or maybe I isolated. Hard to tell. Either way, alone except for online support. They understand medication failures, specialist conflicts, relationship destruction. But virtual support isn't same as real human connection. Diet complicated. Everything restricted for different reason. Basically eat five foods. Cooking for one depressing anyway. Lots of protein shakes. Easier. Looking at clinical trials. Desperate for something to work. But most exclude people with kidney disease. Another door closed. Next option surgery for Crohn's. But recovery with AS would be nightmare. Can't lay flat. Can't bend. How recover from abdominal surgery? Nobody has answer. Sometimes think about ending it. Have plan. Pills saved up. But parents still alive. Can't do that to them. So wait. Endure. Exist. Not living. Just existing. Therapist says find purpose. Easy to say. Hard to do when every day is survival mode. When dreams are dead. When future is just managing decline. What purpose is there in that? Doc wants to try Stelara. Might help both conditions. Kidney doctor reluctant. More arguing between specialists. Meanwhile, I suffer. Always waiting for doctors to agree. For insurance to approve. For something to work. Waiting is all I do. That and hurt. Thirty-seven years old. Supposed to be peak of life. Instead, peak is behind me. All downhill from here. How many years left? Ten? Twenty? Twenty years of this? Can't imagine. Won't imagine. One day at a time. That's all I can handle. Sometimes not even that. One hour at a time. One minute. Whatever it takes to not give up. To honor parents' sacrifice. To prove doctors wrong. To spite this disease. Maybe spite is my purpose now. Too stubborn to let disease win. Not much but it's something. Keeping me going for now. Until parents gone. Then... we'll see."
  },
  {
    "patient_id": "P039",
    "interview_transcript": "Michelle, 41, dealing with Crohn's for about eight years. Also have rheumatoid arthritis and recently diagnosed with fibromyalgia. The pain trifecta. Female, divorced, single mom to teenage son. Started early thirties. Thought it was stress from divorce. Custody battle, financial stress, single parenting. But symptoms persisted after life settled. Chronic diarrhea, weight loss, fatigue beyond normal exhaustion. Finally saw GI. Colonoscopy showed Crohn's throughout. Started mesalamine. Minimal help. Added prednisone for flares. Weight gain horrible. Went from size 6 to 14. Self-esteem shattered. Dating was already hard as single mom. Now overweight sick single mom? Impossible. Started methotrexate. Hair fell out. Bought wig. Another expense I couldn't afford. But needed for work. Real estate agent. Appearance matters. Clients judge. Switched to Humira three years ago. Helps somewhat. Maybe 50%. Then joints started swelling. RA diagnosis. Now injecting for two diseases. Neither controlled well. Fibromyalgia diagnosis came after complaining about widespread pain for years. Doctors kept saying it's the other conditions. Finally someone listened. But treatment limited. More pills. More side effects. Work suffering. Can't show houses all day. Too exhausting. Lost clients. Income dropped. Son needs things - college prep, car, normal teen stuff. Can't provide. He works part-time. Shouldn't have to. Should be enjoying high school. Instead, helping sick mom. Guilt enormous. Ex-husband remarried. New wife healthy, energetic. Everything I'm not. Son loves spending time there. Can't blame him. Fun dad versus sick mom. Easy choice. But still hurts. Support group helps. Other single parents with chronic illness understand. We trade babysitting during flares, share medication discount cards, emotional support. Lifeline really. Insurance through work but high deductible. Hit it by February every year. Then still copays. Medical debt growing. Considered bankruptcy but need decent credit for work. Trapped. Looking at switching to Stelara. Might help both conditions. But injection every 8 weeks means more time off work. Can't afford that either. No good choices. Parents want to help but they're on fixed income. Pride won't let me take more than occasional grocery money. Stupid probably. But need some dignity. Dating attempted once. Disclosed illness upfront. He googled everything. Never called again. Lesson learned. Focus on son now. He'll graduate in two years. Then maybe focus on health. Or maybe by then too sick to work. Trying not to think that far. Doc says stress making everything worse. No kidding. But how not stress? Single mom, chronic illness, financial pressure, teenage son. Stress is my life. Meditation helps minimally. Therapy too expensive. Exercise would help but too painful most days. Another catch-22. Sometimes wonder what life would've been without illness. Still married? Career thriving? Happy? Pointless wondering but can't help it. Especially during son's events. Other moms chatting, me in bathroom. Other families intact, mine broken. Disease didn't cause divorce but didn't help. Next appointment next week. Decision time on Stelara. Will probably try. What else is there? Can't continue at 50%. Son deserves better. I deserve better. Even if better is just 60%. That's 10% more. I'll take it. Sad when 60% functional is goal. But that's reality with multiple chronic illnesses. Lower expectations. Find joy in small improvements. Celebrate tiny victories. Made it through work day. Attended son's game. Cooked dinner. These are achievements now. Pathetic? Maybe. But it's my reality. And I'm still here. Still fighting. For son. For myself. For possibility that tomorrow might be better. Slim possibility. But possibility nonetheless."
  },
  {
    "patient_id": "P040",
    "interview_transcript": "George, 52, diagnosed with Crohn's seven years ago. Was already dealing with type 2 diabetes and hypertension. Then Crohn's joined the party. Male, recently also diagnosed with osteoporosis from years of steroid use. Body falling apart piece by piece. Started mid-forties. Thought it was food poisoning that wouldn't quit. After three months, finally saw doctor. Colonoscopy revealed severe Crohn's throughout colon and terminal ileum. Started aggressive treatment immediately. Prednisone and azathioprine combo. Prednisone sent blood sugars through roof. Needed insulin. Still on it. Azathioprine helped for about two years. Then liver enzymes started climbing. Had to stop. Switched to Remicade. Insurance fought it hard. Six months of appeals while suffering. Finally approved. Worked well for three years. Best I'd felt in years. Then developed antibodies. Stopped working completely within weeks. Tried Humira next. Currently on it but not as effective. Maybe 50% improvement. GI wants to add methotrexate. Worried about liver. Already damaged from diabetes meds and previous Crohn's treatment. But options limited. Work as accountant. Desk job should be manageable. But brain fog from fatigue makes numbers swim. Made significant error last month. Almost lost job. Now double-checking everything. Takes twice as long. Performance reviews suffering. Wife supportive but exhausted. She works full-time too. Comes home to sick husband who can't help with anything. Not the retirement we planned. Kids grown but worried. See them whispering about me. Planning for when I can't work. When I need care. I'm 52, not 82. But feel 82. Maybe 92. Osteoporosis diagnosis was final straw. Bones of 70-year-old. From steroids. Can't exercise much - too fatigued. But need weight-bearing exercise for bones. Another impossible situation. Diet nightmare. Diabetic diet says whole grains, vegetables. Crohn's says white bread, no fiber. Completely contradictory. Nutritionist threw up hands. Said do best you can. Living on protein shakes and supplements. Thousands of dollars annually on supplements. Insurance covers none. Another expense. Medical costs even with good insurance about $15,000 yearly. Retirement savings disappearing. Won't be able to retire. Will work until literally can't. Then what? Disability pays nothing compared to current salary. Social life nonexistent. Friends invite us out. I decline. They stopped asking. Wife goes alone sometimes. Feel guilty but also relieved. She needs normal life. Even if just moments. Support group depressing. Everyone sicker than me. Or will be soon. See my future in their stories. Scary. But also oddly comforting. Not alone in decline. Next appointment discussing clinical trial. New drug. Might help. Might not. Might make worse. But current trajectory unsustainable. Need something different. Worth risk? At 52 with potentially 30 years ahead? Yes. Probably. Maybe. Decision exhausting like everything else. Sometimes think about early retirement on disability. Live simply. Focus on health. But then what about wife? She'd have to support us. Not fair. So continue working. Suffering through days. Pretending to be functional. Wearing mask of normalcy while body rebels. That's hardest part - pretending. Exhausting. But necessary. For job. For wife. For kids. For myself. Because acknowledging reality too depressing. Keep hoping tomorrow better. New drug works. Energy returns. Life resumes. Probably won't happen. But hope necessary. Without it, why continue? And must continue. No choice really. Too many depending on me. Even sick version. Still needed. Still here. Still fighting. One awful day at a time."
  },
  {
    "patient_id": "P041",
    "interview_transcript": "I'm Julie, 35. Diagnosed with Crohn's at 28. Female, also dealing with severe endometriosis and chronic migraines. Started a few years after college. Working crazy hours at investment bank. Thought it was stress, bad diet. Kept pushing through until I collapsed at work. Hospitalization led to diagnosis. Remember the GI saying my intestines looked like a war zone. Started me immediately on prednisone and mesalamine. Had to take medical leave. At investment banking, that's career suicide. They kept me on but I was sidelined. Watched peers get promoted while I struggled to make it through half days. Finally went on Remicade. Worked pretty well for about four years. Got somewhat back on track career-wise. Then it stopped working. Right around same time endometriosis got severe. Surgery recommended but recovery time with Crohn's would be complicated. Can't be on immunosuppressants during surgery but can't be off them either. Impossible choice. Currently on Stelara for Crohn's. It's okay. Maybe 60% better. Endo pain is actually worse than Crohn's some days. Or maybe they compound each other. Taking continuous birth control, pain meds when desperate. But opioids constipate, which triggers Crohn's. Can't win. Migraines increasing. Stress trigger probably. But what stressed person doesn't have my health? Left banking for corporate finance role. Less money but more flexibility. Still had to disclose conditions for accommodations. See how they look at me differently now. The sick employee. High risk. Parents keep asking about grandkids. I'm 35, single, chronically ill. Pregnancy would be high risk even if I found someone. Plus genetics - wouldn't wish these conditions on anyone. But they don't understand. Think I'm being dramatic. Dating attempted a few times. One guy said I had too much baggage. Another ghosted after googling Crohn's. Stopped trying. Focus on survival now. Friends getting married, having kids. I'm scheduling infusions and surgeries. Different life path. Trying to accept it. Therapy helps but therapist admitted she's never had patient with so many painful conditions. We're learning together. Insurance through work good but fighting them constantly. Prior authorizations, appeals, denials. Part-time job managing my healthcare. Exhausting. Considering going part-time at actual job. But would lose benefits. Trapped. Looking into clinical trials. Maybe something will help all conditions. Probably not but hope keeps me going. Otherwise what's the point? Doctor wants to try combination therapy next. Stelara plus methotrexate. More drugs, more monitoring, more side effects. But if it gets me to 75% functional, worth it. Sad that 75% is my goal. Used to aim for excellence in everything. Now just aim for manageable. How far I've fallen. But still employed, still fighting, still here. That's something. Right?"
  },
  {
    "patient_id": "P042",
    "interview_transcript": "Kevin, 39. Crohn's hit me five years ago. Also psoriatic arthritis and now depression from dealing with all this. Male, married, two young kids who don't understand why daddy's always tired or in bathroom. Symptoms started gradually. Thought it was just bad diet, stress from new baby. But got progressively worse. Blood in stool finally sent me to doctor. Colonoscopy confirmed moderate to severe Crohn's. Started on mesalamine and short course prednisone. Helped initially but wasn't lasting solution. Tried adding sulfasalazine. Allergic reaction - hives everywhere. Switched to methotrexate. The nausea was unbearable. Missed so much work. Boss started noticing. Software developer, supposed to be reliable. Wasn't anymore. Finally started Humira. Helps both Crohn's and psoriatic arthritis. About 70% improvement. Best I've felt since diagnosis. But still not normal. Never will be. Wife frustrated. She married healthy guy. Now has sick husband who can't help much with kids. See resentment building. Marriage counseling helping somewhat but elephant in room is my health. Kids, 5 and 3, don't understand. Daddy can't play rough. Daddy needs special food. Daddy's always at doctors. Missing childhood moments. Guilt crushing. Work gone fully remote since COVID. Blessing and curse. Can work around symptoms but also no escape from illness. House is office and sick room. Boundaries blurred. Parents want to help but live across country. In-laws closer but we don't get along. They think I'm exaggerating. MIL suggested yoga would cure me. If only. Finances okay for now. Tech pays well. But medical costs growing. Even with good insurance, probably $10,000 yearly out of pocket. College funds becoming medical funds. Retirement savings depleted. Future uncertain. Diet family challenge. Can't eat what wife cooks for family. Separate meals. More work for her. More resentment. Try to meal prep when feeling good but those days rare. Support group helpful but mostly women. Don't relate to all issues. Found online group for dads with chronic illness. Better. We understand unique challenges - providing while sick, masculine identity crisis, missing kid activities. Looking forward, worried about biologics failing. Already on second one. What happens when run out? Surgery? With two young kids? How recover? Who helps? So many questions. No good answers. Doctor says I'm doing well, considering. Considering what? That I should be worse? Low bar. But grateful for Humira working. For now. Know it won't last forever. Nothing does with Crohn's. Trying to make most of good days. Take kids to park. Date night with wife. Normal family stuff. But always shadow of illness. When will next flare hit? Next medication failure? Next crisis? Can't fully enjoy present when worried about future. But trying. For kids. For wife. For myself. Because giving up not option. Not yet. Too much to live for. Even if living is harder than it should be. That's reality of chronic illness as younger parent. You keep going because you have to. No choice. They need you. Even broken version. So you take your shots, swallow your pills, pretend everything's fine. And some days, almost believe it yourself."
  },
  {
    "patient_id": "P043",
    "interview_transcript": "Sandra, 44. Diagnosed with Crohn's twelve years ago. Female, also have Hashimoto's thyroiditis and recently diagnosed with osteoarthritis in spine. The joys of middle age with autoimmune disease. It started in my early thirties. I was training for a marathon. Thought the GI issues were runner's stomach. But they persisted even when I stopped running. Took two years and three doctors to get diagnosis. By then, significant damage. Had my first surgery at 33. Resection of terminal ileum. Thought that would fix everything. Naive. Disease came back at anastomosis site within year. Started Remicade. Worked beautifully for five years. Got married, had daughter, career thriving. Then developed antibodies. Crashed hard. Tried Humira next. Moderate help. Maybe 60%. Added methotrexate. Hair thinned but improvement to maybe 75%. Manageable. Then thyroid went crazy. Hashimoto's diagnosis. More medication. Synthroid daily. Energy still terrible despite treatment. Is it Crohn's fatigue? Thyroid? Both? Who knows. Spine issues started two years ago. Orthopedist says osteoarthritis. Possibly accelerated by Crohn's inflammation. Or medication. Or just bad luck. Physical therapy helps minimally. Can't do impact exercise anymore. Swimming only. Miss running terribly. Was my stress relief. Identity. Gone. Marriage strained. Husband supportive but exhausted. We're supposed to be partners. Instead, he's caregiver. Not what he signed up for. Daughter, now 8, knows mommy's sick. Tries to help. Too much for her age. Breaking my heart. Should be carefree childhood. Instead, worried about mom. Work challenging. Marketing director. High stress. Probably makes everything worse. But need income and insurance. Husband's job doesn't offer benefits. Trapped. Looking at Stelara next. Humira losing effectiveness. But scared of transition period. What if I flare? Can't afford time off. Already used FMLA this year. Parents aging. Dad has Parkinson's. Mom managing him. Can't burden them with my issues. But need help sometimes. Hire babysitter when too sick. Another expense. Everything costs more with chronic illness. Special food, medications, supplements, childcare, therapy. Probably $20,000 annually beyond insurance. Where does it come from? Credit cards. Debt growing. Worry constantly. Stress makes symptoms worse. Symptoms create stress. Vicious cycle. No escape. Support group disbanded. Leader moved. Nobody stepped up. Now alone. Online groups helpful but not same. Miss real connection. In-person understanding. Friends try but don't get it. Stopped sharing struggles. Easier to pretend okay. Less explaining. Less pity. Less judgment. But also less support. More isolation. Next appointment discussing medication change. Also surgery. Another resection maybe. Or strictureplasty. Scared. Recovery with 8-year-old? How? Who helps? Too many questions. But current path unsustainable. Something needs to change. Quality of life matters. Want to be present for daughter. Active mother. Not sick mom on couch. She deserves better. Husband deserves better. I deserve better. But better might not be possible. Maybe just different version of bad. That's chronic illness reality. Not cure. Just management. Constant adjustments. Medication changes. Expectation lowering. Dream revising. Exhausting. But what choice? Keep going for family. For possibility tomorrow might be easier. Probably won't. But maybe. That maybe keeps me going. Has to. Because alternative too dark to consider. So I research. Plan. Hope. Fight. One day at a time. Sometimes one hour. Whatever it takes to survive this. To be here for them. Even if here is less than hoped. Still here. That counts for something. Right?"
  },
  {
    "patient_id": "P044",
    "interview_transcript": "Peter, 27, diagnosed two years ago but probably had it longer. Male, also ADHD and anxiety. Looking back, signs were there in college but I blamed everything on ADHD meds and poor diet. Adderall can cause stomach issues, right? But after graduation, working as junior architect, symptoms got worse not better. Constant urgency, cramping, blood. Finally saw GI after particularly bad week where I couldn't leave apartment. Colonoscopy showed inflammation throughout sigmoid colon and rectum. Started mesalamine suppositories and oral. Awkward and minimal help. Added prednisone. Energy through roof but anxiety went crazy. Had panic attack during client presentation. Almost lost job. Boss understanding but patience wearing thin. Architecture is deadline-driven. Can't miss those. Started azathioprine six months ago. Helps maybe 40%. Doctor wants to try biologics but I'm terrified. Already immunocompromised enough with stress and lack of sleep. What if I get sick and miss more work? Plus, needles trigger anxiety. Bad. Parents think I'm overreacting. Dad especially. 'Man up' is his favorite phrase. Mom tries but focuses on wrong things. Sends articles about diet cures. If only keto could fix this. Dating is joke. Had one girlfriend since diagnosis. She left because I was 'too much work.' Fair but harsh. Now just focused on surviving. Work from home when possible but architecture requires site visits. Portapotties on construction sites are nightmare with Crohn's. Literal nightmare. Looking at leaving profession. But student loans massive. Need income. Trapped between health and financial survival. Next appointment in two weeks. Will probably agree to biologics. Can't continue at 40% functional. But scared. Really scared. What if makes worse? What if doesn't work? What if, what if, what if. Anxiety and Crohn's feed each other. Therapist helping but it's slow process. Sometimes wonder if this is just my life now. Twenty-seven and already exhausted. How do I do this for fifty more years?"
  },
  {
    "patient_id": "P045",
    "interview_transcript": "Rosa here, 33 years old. Got diagnosed with Crohn's about four months ago but I've been dealing with symptoms for at least two years. Female, also have PCOS and insulin resistance. Doctors kept blaming everything on my weight. Said if I lost weight, digestive issues would resolve. Lost 40 pounds. Issues got worse. Finally demanded colonoscopy. Found inflammation in terminal ileum and ascending colon. Started on budesonide and mesalamine. Some improvement but not much. Doctor mentioned biologics might be next step but insurance wants me to fail more medications first. Currently trying methotrexate. The nausea is terrible. Taking folic acid helps a bit. Work as elementary school teacher. Twenty-five first graders don't wait for teacher to run to bathroom. Already had two close calls. Terrifying. Principal knows about diagnosis but not severity. Scared to tell truth. Budget cuts mean any excuse to let someone go. Parents think it's just stomach problems. Keep saying to try probiotics. Dad brings me yogurt every visit. Sweet but frustrating. They don't understand severity. Or maybe don't want to. Easier to pretend it's minor. Boyfriend of two years supportive but I can see strain. Canceled three weekend trips due to flares. He says it's fine but disappointment obvious. Trying to plan small wedding but how? What if I flare on wedding day? Postponing for now. Another dream on hold. Money tight. Teacher salary doesn't go far. Medical bills piling up. Moved back with parents temporarily to save money. Thirty-three and living at home. Not where I pictured myself. Sometimes the pain is so bad I can't move. Curl up in ball and cry. Then have to get up and teach next day. Smile. Pretend everything fine. Exhausting. Looking at support groups but none meet when I can attend. Online forums helpful but also scary. So many people with surgeries, complications. Is that my future? Trying to stay positive but it's hard..."
  },
  {
    "patient_id": "P046",
    "interview_transcript": "Ben, 49, male. Crohn's diagnosis came eighteen months ago but damage suggests I had it much longer. Construction foreman, also pre-diabetic and have chronic back pain from work injury. Always had tough stomach. Thought it was job sites, truck stop food, stress. Men in construction don't complain about stomach issues. Finally, wife forced me to see doctor after finding blood in toilet. Lots of it. Colonoscopy showed severe disease. Multiple strictures. Doctor amazed I was still working. Started treatment immediately but options limited due to other conditions. Prednisone made blood sugar go haywire. Mesalamine didn't touch it. Currently on Humira. Maybe 50% improvement. Better than nothing but still struggling. Missed so much work that company put me on desk duty. Foreman who can't be on site isn't much use. Probably pushing me out slowly. Twenty-eight years with company. Union protecting me for now but writing's on wall. Wife working double shifts as nurse to prepare for me losing job. She's 47, exhausted. This wasn't our plan. Supposed to be slowing down, planning retirement. Instead, she's killing herself while I'm falling apart. Kids grown but worried. Son wants us to move in with him. Pride won't allow it. Not yet. But might not have choice soon. Sold boat, motorcycle, everything extra. Medical bills eating everything. Insurance good but 20% of biologics still thousands. Don't know how people without union insurance manage..."
  },
  {
    "patient_id": "P047",
    "interview_transcript": "Donna, 41, female. Diagnosed with Crohn's five months ago after years of misdiagnosis. Also hypothyroid and battling depression. Spent three years being told it was IBS, stress, hormones, everything but actual problem. Finally got to good GI who actually listened. Did full workup. Found Crohn's in small intestine. Explains why colonoscopies kept coming back normal. Started on prednisone and mesalamine. Prednisone helped but gain 30 pounds in two months. Already overweight from thyroid issues. Now obese. Self-esteem destroyed. Husband tries to be supportive but I see him looking at other women. Thinner, healthier women. Can't blame him. I'd look too. Trying methotrexate now. Hair falling out. Nausea constant. But some improvement in symptoms. Maybe 30%. Doctor says give it more time. Time for what? To lose all my hair? Marriage? Job? Speaking of job, working as office manager. They don't know yet. Hiding symptoms but getting harder. Running to bathroom during meetings. Exhausted by noon. Making mistakes. Review coming up. Scared. Teenagers know something wrong but not details. Don't want to worry them. Junior year, college prep. They need to focus. Not worry about mom..."
  },
  {
    "patient_id": "P048",
    "interview_transcript": "Larry, 56. Just found out I have Crohn's three weeks ago. Still processing. Male, already dealing with enough - diabetes, heart disease, now this. Went to ER with severe pain. Thought heart attack. Was inflammation in intestines. Emergency surgery to remove blocked section. Woke up with Crohn's diagnosis and foot of intestine gone. Started on medications but too early to know if helping. Mesalamine and antibiotics for now. Doctor wants biologics after I heal from surgery. Recovery has been rough. Living alone makes it harder. Ex-wife helps sometimes but has own life. Kids live out of state. Don't want to worry them. Neighbor checks on me. Meals on wheels started. Humbling for man who used to run construction company. Now can barely make it to bathroom. Savings depleting fast. Surgery bills coming in. Six figures already. Insurance fighting everything. May have to sell house. Only thing I have left from divorce. Then what? Apartment? Assisted living? I'm only 56..."
  },
  {
    "patient_id": "P049",
    "interview_transcript": "Tammy, 28, female. Crohn's diagnosed last month during what should have been routine appendectomy. Surprise! Surgeon found inflammation throughout intestines. Also dealing with eating disorder recovery and anxiety. The Crohn's diagnosis is triggering. Spent years in treatment learning to not fear food. Now have to restrict diet for medical reasons. It's like authorized restriction. Dangerous for someone with my history. Started on prednisone in hospital. Made me manic. Didn't sleep for four days. Parents thought I was relapsing into disorder. Now on mesalamine. Too early to tell if working. GI wants to be aggressive given my age and extent of disease. Mentioned biologics. But reading side effects online. Cancer risk? Serious infections? I'm 28. Whole life ahead. Or maybe not. Boyfriend trying to understand but he's overwhelmed. We'd been talking about marriage, kids. Now everything on hold. He says he's not going anywhere but see doubt. Who wants sick wife? Especially one with mental health history too. Parents hovering. Calling constantly. They went through so much during my eating disorder. Now this. See fear in their eyes. Their baby is sick again. Different but same. Chronic..."
  },
  {
    "patient_id": "P050",
    "interview_transcript": "Victor, 62, male. Diagnosed with Crohn's eight months ago. Already have COPD from forty years of smoking and arthritis. Doctors say I'm complex case. No kidding. Started with what I thought was stomach flu. But lasted months. Lost 50 pounds. Everyone thought cancer. Almost wish it was. At least cancer has endpoint. Either cured or dead. This is just endless middle ground. Started treatment with mesalamine. Nothing. Tried prednisone but breathing got worse. Respiratory doctor said absolutely not. Now on budesonide. Helps a little. Maybe 20%. GI wants to try biologics but lung doctor says too risky with COPD. Might get infection that kills me. So stuck with inadequate treatment. Quality of life terrible. Can't breathe, can't eat, can't leave house much. What's point? Wife died two years ago. Kids busy with own lives. Sitting alone most days. Watching TV. Waiting for next bathroom trip. This isn't living. Pension covers basics but medical costs growing. Medicare doesn't cover everything. Supplements cost fortune. Special food expensive. May have to move in with son. He offered but can see reluctance. His wife doesn't want sick father-in-law. Nobody does. Sometimes think about stopping all medications. Let nature take course. But then grandkids visit. Their smiles keep me going. Want to see them grow up. Graduate. Get married. So I continue. Take pills. Follow restrictions. Pretend there's hope. Maybe there is. Maybe new treatment will come. Maybe I'll get better. Probably not. But maybe. That's all I have left. Maybe."
  }
]
